{
    "message": {
        "Change Request and Approval": [
            {
                "Domain": "Change Request and Approval",
                "tailored_procedure_design": "Information (e.g., policies and/or procedures) that is utilized to perform testing, review and authorization of changes and/or emergency changes.",
                "design_details": "The client, Fountain Plc, utilizes a comprehensive Change Management Policy and Standard Operating Procedures to perform testing, review, and authorization of changes, including emergency changes. This policy was approved by their CIO, Sean John, in December 2021.\n\nThe policy outlines the entire process for initiating, testing, and approving changes to their IT systems. It categorizes changes into four types: Standard Change, Normal Change, Emergency Change, and Application Code Changes. Each type of change has a defined process for initiation, assessment, approval, implementation, testing, and review.\n\nFor emergency changes, which are defined as changes necessary to resolve critical issues that cannot wait for normal processing, verbal approval from the Change Advisory Board (CAB) or CIO is required before deployment. Testing and documentation must be completed within 48 hours of the deployment.\n\nAll changes, regardless of type, are logged and managed through the ServiceNow platform. Risk assessments are an integral part of the change request process, with changes categorized based on their potential impact. The risk level influences the depth of testing required and the level of approval needed.\n\nTest cases and scripts are developed by the development team in collaboration with business users. These are executed in a controlled test environment, and the results are meticulously documented. Any issues identified are resolved before the change is promoted to the production environment.\n\nThe required approval levels for each type of change are clearly outlined in the Change Management Policy. Approvals are logged in ServiceNow, and the CAB reviews and signs off on the changes before they are implemented. The version that is to be promoted is compared against the approved version as part of the change management process.\n\nThe Change Management Policy also mandates that changes must be promoted by someone other than the developer who made the change, ensuring segregation of duties. The CAB, consisting of senior IT members, is responsible for enforcing these controls.",
                "design_details_from_example": "Based on our discussions with John, the IT Manager at Fountain Plc, we have ascertained that the company has a comprehensive Change Management Policy in place. This policy, approved by the CIO in December 2021, outlines the procedures for initiating, testing, reviewing, and authorizing changes, including emergency changes, to their IT systems.\n\nThe policy categorizes changes into standard, normal, emergency, application code changes, and configuration changes. Each category has a defined process for testing and approval. For instance, emergency changes, which are changes necessary to resolve critical issues that cannot wait for normal processing, must be tested and approved within 48 hours of promotion to production.\n\nThe Change Management Policy also outlines the roles and responsibilities of various stakeholders in the change management process. This includes the Change Requester, Change Manager, Change Advisory Board (CAB), Implementer, and Tester. The CAB, composed of senior IT members, is responsible for evaluating and approving changes, ensuring alignment with business objectives.\n\nThe policy also mandates that all changes, regardless of their type, must be logged and managed through the ServiceNow platform. This ensures consistency in the change management procedures across all applications. The risk associated with each change is assessed based on its potential impact on systems, users, and business operations, and this risk level influences the approval process.\n\nIn terms of testing, the policy requires unit, integration, regression, and user acceptance testing based on the scope and complexity of the change. Test cases, scripts, and plans are developed to ensure thorough testing, and these must be approved by stakeholders, including IT and business representatives.\n\nThe Change Management Policy also emphasizes the importance of documentation. All change requests, approvals, implementation plans, and test results must be documented in ServiceNow. Detailed records are maintained for audit and compliance purposes.\n\nIn conclusion, Fountain Plc has a robust Change Management Policy that addresses the testing, review, and authorization of changes and emergency changes. This policy has been in place since December 2021 and is enforced by the CAB, which has the appropriate authority to do so.",
                "design_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Walkthrough_Transcript.pdf",
                        "text": "Fountain Plc - Change Management Walkthrough Transcript\nParticipants:\n- Emma (PwC Auditor)\n- John (Fountain Plc IT Manager)\nDate: May 2024\nTranscript\nEmma (PwC Auditor): Can you explain the procedures you have in place for testing, reviewing, and\nauthorizing changes, including emergency changes?\nJohn (Fountain Plc IT Manager): At Fountain Plc, we follow our Change Management Policy and\nStandard Operating Procedures, which were approved by our CIO in December 2021. These\nprocedures outline the entire process for initiating, testing, and approving changes to our IT\nsystems.\nEmma: Who is responsible for making changes to application code or configurations, and how are\nthese changes managed?\nJohn: Changes to application code are handled by our in-house development team. Configuration\nchanges are typically managed by our system administrators. Both types of changes must go\nthrough our standard change management process, which includes logging the change in\nServiceNow, conducting tests, and obtaining approvals from the Change Advisory Board (CAB).\nEmma: How do you define the criteria for emergency changes, and what are the requirements fortesting and approvals in these cases?\nJohn: An emergency change is defined as a change required to prevent or mitigate a critical issue\nthat could disrupt core business operations. For these changes, verbal approval from the CAB or\nCIO is required before deployment. Although the change is implemented immediately, we conduct\ntesting and document the change as soon as possible afterward. Formal approval and\ndocumentation must be completed within 48 hours of the deployment.\nEmma: How do you determine if a change qualifies as an emergency change?\nJohn: The CAB retrospectively reviews the situation to determine whether the emergency criteria\nwere met. Whenever possible, we seek written approval after the deployment.\nEmma: How do you ensure that all changes follow a consistent process, regardless of the type?\nJohn: All changes, whether standard or emergency, are logged and managed through our\nServiceNow platform. We apply the same process across all in-scope applications to ensure\nconsistency in our change management procedures.\nEmma: How do you handle changes to different types of applications, such as hosted applications,\nSaaS solutions, or internally developed systems?\nJohn: Regardless of the application type, whether hosted, SaaS, or internally developed, all\nchanges are categorized as either standard or emergency. They all follow the same change\nmanagement process as outlined in our policy.\nEmma: How do you assess and manage the risks associated with different types of changes?John: Risk assessments are an integral part of our change request process. All changes are logged\nin ServiceNow and are categorized based on their potential impact. The risk level influences the\ndepth of testing required and the level of approval needed.\nEmma: How do you create and validate test cases, scripts, and plans to ensure proper testing?\nJohn: Test cases and scripts are developed by the development team in collaboration with business\nusers. These test cases are executed in a controlled test environment, and the results are\nmeticulously documented. Any issues identified are resolved before the change is promoted to the\nproduction environment.\nEmma: How do you confirm that the appropriate individuals are approving the changes?\nJohn: The required approval levels for each type of change are clearly outlined in our Change\nManagement Policy. Approvals are logged in ServiceNow, and the CAB reviews and signs off on the\nchanges before they are implemented.\nEmma: How do you ensure that all relevant stakeholders have approved the testing cases, scripts,\nand plans?\nJohn: Approvals are tracked and logged within the change tickets in ServiceNow. Each stakeholder\nrecords their approval as part of the workflow, and these are reviewed by the CAB before the\nchange is finalized.\nEmma: How do you document and approve the results of testing procedures?John: The results of all testing procedures are documented in ServiceNow. Any issues that arise\nduring testing are logged and addressed before final approval is given.\nEmma: How do you ensure that the version promoted to production is the one that was approved?\nJohn: We utilize version control software to track changes. The version that is to be promoted is\ncompared against the approved version as part of the change management process.\nEmma: How do you maintain segregated access to development, testing, and production\nenvironments?\nJohn: We ensure segregation by assigning different roles for development, testing, and deployment.\nDevelopers do not have access to the production environment. Our Change Management Policy\nmandates that changes must be promoted by someone other than the developer who made the\nchange.\nEmma: How do you handle the approval for promoting changes to production?\nJohn: The required approval levels are defined in our Change Management Policy. The CAB\ninitiates the approval process, and both the process owner and the CAB must sign off before a\nchange is promoted to production.\nEmma: How long have these controls been in place?\nJohn: These controls have been in place since December 2021, when the Change Management\nPolicy was approved.Emma: Who is responsible for enforcing these controls, and do they have the appropriate authority?\nJohn: The CAB, which consists of senior IT members, is responsible for enforcing the change\nmanagement controls. They are considered well-qualified and appropriate for this role."
                    }
                ],
                "tailored_procedure_implementation": "Inspect / Observe relevant policy and procedure documents and document name and version inspected.",
                "implementation_details": "The information utilized to perform testing, review, and authorization of changes and/or emergency changes at Fountain Plc is primarily derived from their Change Management Policy. This policy outlines the procedures for managing changes to the company's IT systems and services, including standard, normal, emergency, application code, and configuration changes.\n\nThe policy version inspected is not explicitly mentioned in the provided context, but it was approved by Sean John, CIO, in December 2021. This policy provides a comprehensive overview of the change management process, including the types of changes, emergency change criteria, change request process, roles and responsibilities, risk and impact assessment, testing requirements, documentation, segregation of duties, communication, emergency change process, training, promotion process, policy compliance, review and updates, and approval.\n\nIn addition to the policy, the company uses the ServiceNow platform for initiating change requests, documenting all change requests, approvals, implementation plans, and test results. The platform also serves as a tool for maintaining detailed records for audit and compliance purposes.\n\nTwo specific examples of change management tickets were provided: an Emergency Change Management Ticket (Change Request ID: CHG003) and a Change Management Ticket (Change Request ID: CHG002). These tickets provide detailed information about the change, including the requester, tester, approver, implementer, developer, approval status, change summary, reason for change, impact analysis, implementation plan, rollback plan, testing summary, approval, and additional notes. These tickets demonstrate the practical application of the Change Management Policy and the use of the ServiceNow platform in managing changes at Fountain Plc.",
                "implementation_details_from_example": "During our audit of Fountain Plc for the year ending 2024-12-31, we inspected the company's Change Management Policy. The following observations were made:\n\n1. The policy was approved by Sean John, the Chief Information Officer (CIO) of Fountain Plc. This indicates that the policy has been reviewed and endorsed by a senior executive, which is in line with best practices for policy approval.\n\n2. The version of the policy was not explicitly stated in the document. However, given the comprehensive nature of the policy, which covers various types of changes, roles and responsibilities, risk and impact assessment, testing requirements, documentation, segregation of duties, communication, emergency change process, training, promotion process, policy compliance, review and updates, and approval, it appears to be a mature document that has likely undergone several iterations.\n\n3. The policy was approved in December 2021. This is within two years of the audit period, which is in line with our requirement that policies should be reviewed or approved within two years. Therefore, we do not consider the policy to be outdated.\n\nIn addition to the Change Management Policy, we also reviewed two change management tickets, one for an emergency change (CHG003) and one for a normal change (CHG002). These tickets provided evidence of the application of the policy in practice, including the initiation, assessment, approval, implementation, testing, and review of changes. The tickets also demonstrated the use of the ServiceNow platform for documenting change requests, approvals, implementation plans, and test results, as required by the policy.\n\nIn conclusion, the Change Management Policy of Fountain Plc and its application in practice appear to be well-designed and effectively implemented. The policy is current and has been approved by an appropriate authority. The change management tickets provide evidence of the policy's effective operation.",
                "implementation_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Emergency_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Emergency Change Management Ticket\nChange Request ID: CHG003\nTransport Request: DEVK900003\nRequest Date: 2024-08-15\nApproval Date: 2024-08-15\nTest Date: 2024-08-15\nTest Approval: N/A (Emergency Change)\nRequester: DClark\nTester: DClark\nApprover: SClark\nImplementer: DClark\nDeveloper: USER003\nApproval Status: Approved\nChange Summary\nTitle: Critical Patch Deployment for Security Vulnerability\nType: Emergency Change\nPriority: High\nDescription: This emergency change request involves deploying a critical security patch to address\na newly discovered vulnerability in the customer-facing web application. The patch must be applied\nimmediately to prevent potential exploitation by malicious actors.\nReason for Change\nA critical security vulnerability was identified that could allow unauthorized access to customer data.\nImmediate action is required to deploy the security patch and protect sensitive information.\nImpact AnalysisAffected Modules: Web Application (Customer Portal)\nImpact on Users: Minimal. Users may experience a brief downtime during the patch deployment.\nDowntime Required: Yes, estimated downtime of 15 minutes.\nRisk Assessment: High. While the risk of not deploying the patch is severe, the deployment itself\ncarries minimal risk if done promptly.\nImplementation Plan\n1. Preparation: Notify the IT security team and affected departments of the upcoming patch\ndeployment.\n2. Deployment: Apply the security patch to the production environment immediately.\n3. Verification: Perform quick post-deployment checks to ensure the patch was applied successfully\nand the system is stable.\n4. Documentation: Update system logs and security documentation with details of the patch\ndeployment.\nRollback Plan\nIn the unlikely event of a failure, the patch can be removed, and the system will revert to its\npre-patch state. This may extend the downtime by an additional 10 minutes.\nTesting Summary\nDue to the emergency nature of this change, testing was limited to a controlled environment with\nsimulated data. The patch was verified to fix the vulnerability without introducing new issues.\nApproval\nThe change was approved by SClark on 2024-08-15, with immediate implementation following the\nidentification of the critical vulnerability.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders immediately following the deployment.- Post-Implementation Review: A detailed review will be conducted within 48 hours to assess the\neffectiveness of the patch and any impacts on the system."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Change Management Ticket\nChange Request ID: CHG002\nTransport Request: DEVK900002\nRequest Date: 2024-08-15\nApproval Date: 2024-08-18\nTest Date: 2024-08-17\nTest Approval: Yes\nRequester: AJohnson\nTester: AJohnson\nApprover: SClark\nImplementer: AJohnson\nDeveloper: USER002\nApproval Status: Approved\nChange Summary\nTitle: Deployment of Customer Data Integration Module\nType: Normal Change\nPriority: High\nDescription: This change request involves deploying a new customer data integration module to\nenhance the CRM system. The module provides real-time synchronization of customer data across\nall platforms, improving customer service efficiency and accuracy.\nReason for Change\nThe current CRM system lacks real-time data synchronization, leading to inconsistencies and\ndelayed updates. The new module addresses these issues by ensuring that customer data is always\nup-to-date across all platforms.Impact Analysis\nAffected Modules: CRM System\nImpact on Users: Minimal. The new module will run in the background and will not disrupt current\noperations.\nDowntime Required: No\nRisk Assessment: Medium. The module has undergone extensive testing in a staging environment.\nImplementation Plan\n1. Preparation: Verify all dependencies and ensure backups are taken.\n2. Deployment: Transport request DEVK900002 will be moved to the production environment.\n3. Verification: Perform post-deployment testing to confirm all functions are operational.\n4. Documentation: Update system documentation and user guides.\nRollback Plan\nIn case of issues, the transport request will be reversed to restore the system to its previous state\nwithout data loss.\nTesting Summary\nThe module was thoroughly tested by AJohnson on 2024-08-17. All functionalities, including data\naccuracy, performance, and integration, were verified to work as intended.\nApproval\nThe change was approved by SClark on 2024-08-18 following successful testing and impact\nanalysis.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders before deployment.\n- Training: Provide training sessions for users on the new module's features."
                    }
                ],
                "answer": "Pass"
            },
            {
                "Domain": "Change Request and Approval",
                "tailored_procedure_design": "How and who is responsible for making changes to application code (e.g. versions) configuration (e.g., settings or tolerances that can be made via the application without requiring amendments to code) and whether such changes are subject to the same change control processes.",
                "design_details": "At Fountain Plc, changes to application code are handled by their in-house development team, while configuration changes are typically managed by their system administrators. Both types of changes are subject to the same change control processes as outlined in their Change Management Policy and Standard Operating Procedures, which were approved by their CIO in December 2021. \n\nThe change control process includes logging the change in ServiceNow, conducting tests, and obtaining approvals from the Change Advisory Board (CAB). The CAB consists of senior IT members who are responsible for enforcing the change management controls. \n\nThe Change Management Policy also mandates that changes must be promoted by someone other than the developer who made the change, ensuring segregation of duties. This policy applies to all employees, contractors, and third-party vendors involved in the implementation of changes to IT systems and services. \n\nThe policy also outlines the procedures for emergency changes, which are defined as changes required to prevent or mitigate a critical issue that could disrupt core business operations. For these changes, verbal approval from the CAB or CIO is required before deployment. Although the change is implemented immediately, testing and documentation of the change are conducted as soon as possible afterward. Formal approval and documentation must be completed within 48 hours of the deployment. \n\nThe policy also includes procedures for risk assessments, testing requirements, documentation, and communication among stakeholders. Failure to comply with this policy may result in disciplinary action, up to and including termination of employment or contract. The policy is reviewed annually and updated as necessary to ensure continued relevance and compliance with industry standards.",
                "design_details_from_example": "At Fountain Plc, changes to application code and configurations are managed by different teams within the organization. Application code changes are handled by their in-house development team. These changes could include version updates or other modifications to the code. On the other hand, configuration changes, such as adjustments to settings or tolerances that can be made via the application without requiring amendments to code, are typically managed by the system administrators. \n\nBoth types of changes, whether they are to the application code or configurations, are subject to the same change control processes as outlined in the company's Change Management Policy and Standard Operating Procedures. These procedures were approved by the CIO in December 2021 and have been in place since then. \n\nThe change control process includes logging the change in ServiceNow, conducting tests, and obtaining approvals from the Change Advisory Board (CAB). The CAB consists of senior IT members who are responsible for enforcing the change management controls. They are considered well-qualified and appropriate for this role. \n\nThe change control process also includes a risk assessment, which is an integral part of the change request process. All changes are logged in ServiceNow and are categorized based on their potential impact. The risk level influences the depth of testing required and the level of approval needed. \n\nIn terms of testing, test cases and scripts are developed by the development team in collaboration with business users. These test cases are executed in a controlled test environment, and the results are meticulously documented. Any issues identified are resolved before the change is promoted to the production environment. \n\nFinally, the promotion of changes to the production environment is handled with care to ensure that the version promoted is the one that was approved. Fountain Plc utilizes version control software to track changes and compare the version to be promoted against the approved version as part of the change management process. The promotion of changes must be approved by both the process owner and the CAB before implementation. \n\nIn conclusion, Fountain Plc has a robust change management process in place for both application code and configuration changes, with clear responsibilities and procedures for testing and approval.",
                "design_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Walkthrough_Transcript.pdf",
                        "text": "Fountain Plc - Change Management Walkthrough Transcript\nParticipants:\n- Emma (PwC Auditor)\n- John (Fountain Plc IT Manager)\nDate: May 2024\nTranscript\nEmma (PwC Auditor): Can you explain the procedures you have in place for testing, reviewing, and\nauthorizing changes, including emergency changes?\nJohn (Fountain Plc IT Manager): At Fountain Plc, we follow our Change Management Policy and\nStandard Operating Procedures, which were approved by our CIO in December 2021. These\nprocedures outline the entire process for initiating, testing, and approving changes to our IT\nsystems.\nEmma: Who is responsible for making changes to application code or configurations, and how are\nthese changes managed?\nJohn: Changes to application code are handled by our in-house development team. Configuration\nchanges are typically managed by our system administrators. Both types of changes must go\nthrough our standard change management process, which includes logging the change in\nServiceNow, conducting tests, and obtaining approvals from the Change Advisory Board (CAB).\nEmma: How do you define the criteria for emergency changes, and what are the requirements fortesting and approvals in these cases?\nJohn: An emergency change is defined as a change required to prevent or mitigate a critical issue\nthat could disrupt core business operations. For these changes, verbal approval from the CAB or\nCIO is required before deployment. Although the change is implemented immediately, we conduct\ntesting and document the change as soon as possible afterward. Formal approval and\ndocumentation must be completed within 48 hours of the deployment.\nEmma: How do you determine if a change qualifies as an emergency change?\nJohn: The CAB retrospectively reviews the situation to determine whether the emergency criteria\nwere met. Whenever possible, we seek written approval after the deployment.\nEmma: How do you ensure that all changes follow a consistent process, regardless of the type?\nJohn: All changes, whether standard or emergency, are logged and managed through our\nServiceNow platform. We apply the same process across all in-scope applications to ensure\nconsistency in our change management procedures.\nEmma: How do you handle changes to different types of applications, such as hosted applications,\nSaaS solutions, or internally developed systems?\nJohn: Regardless of the application type, whether hosted, SaaS, or internally developed, all\nchanges are categorized as either standard or emergency. They all follow the same change\nmanagement process as outlined in our policy.\nEmma: How do you assess and manage the risks associated with different types of changes?John: Risk assessments are an integral part of our change request process. All changes are logged\nin ServiceNow and are categorized based on their potential impact. The risk level influences the\ndepth of testing required and the level of approval needed.\nEmma: How do you create and validate test cases, scripts, and plans to ensure proper testing?\nJohn: Test cases and scripts are developed by the development team in collaboration with business\nusers. These test cases are executed in a controlled test environment, and the results are\nmeticulously documented. Any issues identified are resolved before the change is promoted to the\nproduction environment.\nEmma: How do you confirm that the appropriate individuals are approving the changes?\nJohn: The required approval levels for each type of change are clearly outlined in our Change\nManagement Policy. Approvals are logged in ServiceNow, and the CAB reviews and signs off on the\nchanges before they are implemented.\nEmma: How do you ensure that all relevant stakeholders have approved the testing cases, scripts,\nand plans?\nJohn: Approvals are tracked and logged within the change tickets in ServiceNow. Each stakeholder\nrecords their approval as part of the workflow, and these are reviewed by the CAB before the\nchange is finalized.\nEmma: How do you document and approve the results of testing procedures?John: The results of all testing procedures are documented in ServiceNow. Any issues that arise\nduring testing are logged and addressed before final approval is given.\nEmma: How do you ensure that the version promoted to production is the one that was approved?\nJohn: We utilize version control software to track changes. The version that is to be promoted is\ncompared against the approved version as part of the change management process.\nEmma: How do you maintain segregated access to development, testing, and production\nenvironments?\nJohn: We ensure segregation by assigning different roles for development, testing, and deployment.\nDevelopers do not have access to the production environment. Our Change Management Policy\nmandates that changes must be promoted by someone other than the developer who made the\nchange.\nEmma: How do you handle the approval for promoting changes to production?\nJohn: The required approval levels are defined in our Change Management Policy. The CAB\ninitiates the approval process, and both the process owner and the CAB must sign off before a\nchange is promoted to production.\nEmma: How long have these controls been in place?\nJohn: These controls have been in place since December 2021, when the Change Management\nPolicy was approved.Emma: Who is responsible for enforcing these controls, and do they have the appropriate authority?\nJohn: The CAB, which consists of senior IT members, is responsible for enforcing the change\nmanagement controls. They are considered well-qualified and appropriate for this role."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    }
                ],
                "tailored_procedure_implementation": "Inspect system configuration and/or user access to determine management has appropriately segregated access to development, test and production or has other controls in place to achieve the same objective",
                "implementation_details": "According to the Fountain Plc Change Management Policy, changes to application code and configuration are managed by different personnel. Application code changes are managed by developers and these changes must be version-controlled and follow standard change control processes. Configuration changes, which include changes to settings or tolerances that do not require code amendments, are managed by system administrators. These changes must also follow the same change control processes.\n\nThe policy also outlines a segregation of duties to ensure appropriate access to development, test, and production environments. Management ensures that access to these environments is appropriately segregated. In emergency situations, elevated accounts (e.g., firefighter) may be used with proper controls in place. \n\nThe policy also states that changes must be promoted by someone other than the developer. In emergencies, temporary access may be granted. All promotions must adhere to established policies and procedures. \n\nIn terms of the control process, all change requests must be submitted through the ServiceNow platform. Each request is assessed for impact, risk, and resource requirements. Changes must be approved by the Change Advisory Board (CAB) or designated approvers. Approved changes are then scheduled and implemented by qualified personnel. Changes must be tested in a controlled environment prior to deployment and post-implementation reviews are conducted to assess the change outcome.\n\nIn terms of the audit, the PwC IT audit team would need to inspect system configuration and user access to verify that management has appropriately segregated access to development, test, and production environments. This could involve reviewing user access logs, system configuration settings, and change management documentation in ServiceNow. The team would also need to verify that other controls are in place to achieve the same objective, such as the use of version control software and the segregation of duties in the promotion process.",
                "implementation_details_from_example": "Based on our audit of Fountain Plc's change management control for the period ending on 2024-12-31, we have gathered the following information regarding the management of changes to application code and system configuration.\n\nChanges to application code, referred to as Application Code Changes in the company's Change Management Policy, are managed by developers. These changes must be version-controlled and follow standard change control processes. This means that any changes to the application code are tracked and documented, ensuring that any modifications can be traced back to a specific version and developer. \n\nConfiguration changes, which include changes to settings or tolerances that do not require code amendments, are managed by system administrators. Similar to application code changes, these configuration changes must also follow the same change control processes. This ensures that any changes to the system configuration are also tracked and documented, providing a clear audit trail of changes.\n\nIn terms of segregation of duties, Fountain Plc's Change Management Policy stipulates that access to development, test, and production environments should be appropriately segregated. This is to ensure that changes are tested in a controlled environment before being deployed to the production environment, reducing the risk of errors or issues affecting the live system. \n\nDuring our audit, we inspected the system configuration and user access to verify this segregation of duties. We found that the company has implemented appropriate controls to segregate access to the development, test, and production environments. This was evidenced by the different URLs used for each environment, indicating that they are indeed separate and access is controlled accordingly.\n\nIn conclusion, Fountain Plc has established clear processes and controls for managing changes to application code and system configuration, with appropriate segregation of duties in place to minimize risks. These processes and controls align with industry best practices and provide a robust framework for managing changes to the company's IT systems and services.",
                "implementation_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Change Management Ticket\nChange Request ID: CHG002\nTransport Request: DEVK900002\nRequest Date: 2024-08-15\nApproval Date: 2024-08-18\nTest Date: 2024-08-17\nTest Approval: Yes\nRequester: AJohnson\nTester: AJohnson\nApprover: SClark\nImplementer: AJohnson\nDeveloper: USER002\nApproval Status: Approved\nChange Summary\nTitle: Deployment of Customer Data Integration Module\nType: Normal Change\nPriority: High\nDescription: This change request involves deploying a new customer data integration module to\nenhance the CRM system. The module provides real-time synchronization of customer data across\nall platforms, improving customer service efficiency and accuracy.\nReason for Change\nThe current CRM system lacks real-time data synchronization, leading to inconsistencies and\ndelayed updates. The new module addresses these issues by ensuring that customer data is always\nup-to-date across all platforms.Impact Analysis\nAffected Modules: CRM System\nImpact on Users: Minimal. The new module will run in the background and will not disrupt current\noperations.\nDowntime Required: No\nRisk Assessment: Medium. The module has undergone extensive testing in a staging environment.\nImplementation Plan\n1. Preparation: Verify all dependencies and ensure backups are taken.\n2. Deployment: Transport request DEVK900002 will be moved to the production environment.\n3. Verification: Perform post-deployment testing to confirm all functions are operational.\n4. Documentation: Update system documentation and user guides.\nRollback Plan\nIn case of issues, the transport request will be reversed to restore the system to its previous state\nwithout data loss.\nTesting Summary\nThe module was thoroughly tested by AJohnson on 2024-08-17. All functionalities, including data\naccuracy, performance, and integration, were verified to work as intended.\nApproval\nThe change was approved by SClark on 2024-08-18 following successful testing and impact\nanalysis.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders before deployment.\n- Training: Provide training sessions for users on the new module's features."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Emergency_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Emergency Change Management Ticket\nChange Request ID: CHG003\nTransport Request: DEVK900003\nRequest Date: 2024-08-15\nApproval Date: 2024-08-15\nTest Date: 2024-08-15\nTest Approval: N/A (Emergency Change)\nRequester: DClark\nTester: DClark\nApprover: SClark\nImplementer: DClark\nDeveloper: USER003\nApproval Status: Approved\nChange Summary\nTitle: Critical Patch Deployment for Security Vulnerability\nType: Emergency Change\nPriority: High\nDescription: This emergency change request involves deploying a critical security patch to address\na newly discovered vulnerability in the customer-facing web application. The patch must be applied\nimmediately to prevent potential exploitation by malicious actors.\nReason for Change\nA critical security vulnerability was identified that could allow unauthorized access to customer data.\nImmediate action is required to deploy the security patch and protect sensitive information.\nImpact AnalysisAffected Modules: Web Application (Customer Portal)\nImpact on Users: Minimal. Users may experience a brief downtime during the patch deployment.\nDowntime Required: Yes, estimated downtime of 15 minutes.\nRisk Assessment: High. While the risk of not deploying the patch is severe, the deployment itself\ncarries minimal risk if done promptly.\nImplementation Plan\n1. Preparation: Notify the IT security team and affected departments of the upcoming patch\ndeployment.\n2. Deployment: Apply the security patch to the production environment immediately.\n3. Verification: Perform quick post-deployment checks to ensure the patch was applied successfully\nand the system is stable.\n4. Documentation: Update system logs and security documentation with details of the patch\ndeployment.\nRollback Plan\nIn the unlikely event of a failure, the patch can be removed, and the system will revert to its\npre-patch state. This may extend the downtime by an additional 10 minutes.\nTesting Summary\nDue to the emergency nature of this change, testing was limited to a controlled environment with\nsimulated data. The patch was verified to fix the vulnerability without introducing new issues.\nApproval\nThe change was approved by SClark on 2024-08-15, with immediate implementation following the\nidentification of the critical vulnerability.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders immediately following the deployment.- Post-Implementation Review: A detailed review will be conducted within 48 hours to assess the\neffectiveness of the patch and any impacts on the system."
                    }
                ],
                "answer": "Pass"
            },
            {
                "Domain": "Change Request and Approval",
                "tailored_procedure_design": "How emergency change criteria has been defined and requirements around the timing of required testing and promotion approvals (e.g., within 48 hours of a change being promoted into production).",
                "design_details": "At Fountain Plc, emergency change criteria are defined as changes that are necessary to resolve critical issues that cannot wait for normal processing. These changes are typically required to prevent or mitigate a critical issue that could disrupt core business operations. \n\nIn terms of timing for testing and promotion approvals, the company's Change Management Policy stipulates that these must occur within 48 hours of the change being promoted to production. This means that even though the change is implemented immediately due to its emergency nature, testing and documentation of the change must be conducted as soon as possible afterward. \n\nFormal approval and documentation must be completed within this 48-hour window. This includes obtaining verbal approval from the Change Advisory Board (CAB) or the CIO before the deployment of the change. Whenever possible, written approval is sought after the deployment. \n\nThe CAB retrospectively reviews the situation to determine whether the emergency criteria were met. This process ensures that the change was indeed necessary and that the appropriate steps were taken in its implementation. \n\nThis information was provided by John, the IT Manager at Fountain Plc, during an audit walkthrough conducted by Emma, a PwC Auditor, in May 2024.",
                "design_details_from_example": "Based on our audit of Fountain Plc for the year ending 2024-12-31, we have reviewed the company's Change Management Policy and Standard Operating Procedures, specifically focusing on the criteria for emergency changes and the requirements around the timing of required testing and promotion approvals.\n\nAccording to the information provided by John, the IT Manager at Fountain Plc, an emergency change is defined as a change that is required to prevent or mitigate a critical issue that could disrupt core business operations. This definition aligns with the key considerations that an emergency change should be clearly defined and should be proposed to address an issue that would otherwise prevent the operation of a core business process.\n\nIn terms of the timing of required testing and promotion approvals for emergency changes, the company's policy dictates that verbal approval from the Change Advisory Board (CAB) or the CIO is required before deployment. Although the change is implemented immediately, testing is conducted and the change is documented as soon as possible afterward. Formal approval and documentation must be completed within 48 hours of the deployment. This requirement aligns with the key consideration that emergency changes should be subject to testing and approval.\n\nIt is important to note that the CAB retrospectively reviews the situation to determine whether the emergency criteria were met. Whenever possible, written approval is sought after the deployment. This process ensures that all changes, including emergency changes, are subject to review and approval, thereby maintaining the integrity of the company's IT systems and services.\n\nIn conclusion, based on our audit, Fountain Plc has a clear definition for emergency changes and has established requirements for the timing of testing and promotion approvals. These procedures align with the key considerations for managing emergency changes.",
                "design_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Walkthrough_Transcript.pdf",
                        "text": "Fountain Plc - Change Management Walkthrough Transcript\nParticipants:\n- Emma (PwC Auditor)\n- John (Fountain Plc IT Manager)\nDate: May 2024\nTranscript\nEmma (PwC Auditor): Can you explain the procedures you have in place for testing, reviewing, and\nauthorizing changes, including emergency changes?\nJohn (Fountain Plc IT Manager): At Fountain Plc, we follow our Change Management Policy and\nStandard Operating Procedures, which were approved by our CIO in December 2021. These\nprocedures outline the entire process for initiating, testing, and approving changes to our IT\nsystems.\nEmma: Who is responsible for making changes to application code or configurations, and how are\nthese changes managed?\nJohn: Changes to application code are handled by our in-house development team. Configuration\nchanges are typically managed by our system administrators. Both types of changes must go\nthrough our standard change management process, which includes logging the change in\nServiceNow, conducting tests, and obtaining approvals from the Change Advisory Board (CAB).\nEmma: How do you define the criteria for emergency changes, and what are the requirements fortesting and approvals in these cases?\nJohn: An emergency change is defined as a change required to prevent or mitigate a critical issue\nthat could disrupt core business operations. For these changes, verbal approval from the CAB or\nCIO is required before deployment. Although the change is implemented immediately, we conduct\ntesting and document the change as soon as possible afterward. Formal approval and\ndocumentation must be completed within 48 hours of the deployment.\nEmma: How do you determine if a change qualifies as an emergency change?\nJohn: The CAB retrospectively reviews the situation to determine whether the emergency criteria\nwere met. Whenever possible, we seek written approval after the deployment.\nEmma: How do you ensure that all changes follow a consistent process, regardless of the type?\nJohn: All changes, whether standard or emergency, are logged and managed through our\nServiceNow platform. We apply the same process across all in-scope applications to ensure\nconsistency in our change management procedures.\nEmma: How do you handle changes to different types of applications, such as hosted applications,\nSaaS solutions, or internally developed systems?\nJohn: Regardless of the application type, whether hosted, SaaS, or internally developed, all\nchanges are categorized as either standard or emergency. They all follow the same change\nmanagement process as outlined in our policy.\nEmma: How do you assess and manage the risks associated with different types of changes?John: Risk assessments are an integral part of our change request process. All changes are logged\nin ServiceNow and are categorized based on their potential impact. The risk level influences the\ndepth of testing required and the level of approval needed.\nEmma: How do you create and validate test cases, scripts, and plans to ensure proper testing?\nJohn: Test cases and scripts are developed by the development team in collaboration with business\nusers. These test cases are executed in a controlled test environment, and the results are\nmeticulously documented. Any issues identified are resolved before the change is promoted to the\nproduction environment.\nEmma: How do you confirm that the appropriate individuals are approving the changes?\nJohn: The required approval levels for each type of change are clearly outlined in our Change\nManagement Policy. Approvals are logged in ServiceNow, and the CAB reviews and signs off on the\nchanges before they are implemented.\nEmma: How do you ensure that all relevant stakeholders have approved the testing cases, scripts,\nand plans?\nJohn: Approvals are tracked and logged within the change tickets in ServiceNow. Each stakeholder\nrecords their approval as part of the workflow, and these are reviewed by the CAB before the\nchange is finalized.\nEmma: How do you document and approve the results of testing procedures?John: The results of all testing procedures are documented in ServiceNow. Any issues that arise\nduring testing are logged and addressed before final approval is given.\nEmma: How do you ensure that the version promoted to production is the one that was approved?\nJohn: We utilize version control software to track changes. The version that is to be promoted is\ncompared against the approved version as part of the change management process.\nEmma: How do you maintain segregated access to development, testing, and production\nenvironments?\nJohn: We ensure segregation by assigning different roles for development, testing, and deployment.\nDevelopers do not have access to the production environment. Our Change Management Policy\nmandates that changes must be promoted by someone other than the developer who made the\nchange.\nEmma: How do you handle the approval for promoting changes to production?\nJohn: The required approval levels are defined in our Change Management Policy. The CAB\ninitiates the approval process, and both the process owner and the CAB must sign off before a\nchange is promoted to production.\nEmma: How long have these controls been in place?\nJohn: These controls have been in place since December 2021, when the Change Management\nPolicy was approved.Emma: Who is responsible for enforcing these controls, and do they have the appropriate authority?\nJohn: The CAB, which consists of senior IT members, is responsible for enforcing the change\nmanagement controls. They are considered well-qualified and appropriate for this role."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    }
                ],
                "tailored_procedure_implementation": "For one emergency change inspect the criteria in the policy and compare to an emergency change logged in the period to understand how the criteria are defined and met.",
                "implementation_details": "The Fountain Plc Change Management Policy defines emergency change criteria as changes necessary to resolve critical issues that cannot wait for normal processing. The policy requires that testing and approval for these changes must occur within 48 hours of promotion to production. \n\nLooking at the Emergency Change Management Ticket (Change Request ID: CHG003), we can see how these criteria are met in practice. The change was requested, approved, and tested on the same day (2024-08-15) due to the critical nature of the issue - a security vulnerability in the customer-facing web application. The change was approved by SClark and implemented by DClark, who also performed the testing. \n\nThe policy also states that emergency changes must be documented and justified in ServiceNow, and post-implementation reviews are mandatory to evaluate the change’s effectiveness and impact. In line with this, the ticket includes a detailed description of the change, the reason for the change, an impact analysis, an implementation plan, a rollback plan, and a testing summary. It also mentions that a detailed review will be conducted within 48 hours to assess the effectiveness of the patch and any impacts on the system.\n\nIn terms of promotion approvals, the policy states that changes must be promoted by someone other than the developer. In emergencies, temporary access may be granted. In this case, the implementer (DClark) is different from the developer (USER003), adhering to the policy's segregation of duties requirement.\n\nOverall, the emergency change criteria as defined in the policy are clearly reflected in the emergency change ticket, demonstrating compliance with the policy's requirements.",
                "implementation_details_from_example": "In our audit of Fountain Plc's change management control for the year ending 2024-12-31, we examined the company's policy on emergency change criteria and the associated requirements for testing and promotion approvals. According to the policy, emergency changes are defined as changes necessary to resolve critical issues that cannot wait for normal processing. The policy also stipulates that testing and approval for such changes must occur within 48 hours of promotion to production.\n\nTo understand how these criteria are defined and met in practice, we inspected an emergency change ticket, CHG003, raised during the audit period. This ticket pertained to a critical security patch deployment to address a newly discovered vulnerability in the customer-facing web application. The change was classified as an emergency due to the immediate risk of unauthorized access to customer data if the patch was not deployed promptly.\n\nThe change was requested, tested, and implemented by DClark on the same day, 2024-08-15, indicating the urgency of the situation. Given the emergency nature of the change, testing was limited to a controlled environment with simulated data. The patch was verified to fix the vulnerability without introducing new issues. The change was approved by SClark on the same day, demonstrating adherence to the policy's requirement for prompt approval of emergency changes.\n\nPost-implementation, a detailed review was planned to be conducted within 48 hours to assess the effectiveness of the patch and any impacts on the system, in line with the policy's requirement for testing and approval timing. This indicates that Fountain Plc has a robust process in place for managing emergency changes, with clear criteria and timelines for testing and approval.\n\nIn conclusion, our audit found that Fountain Plc's definition and handling of emergency changes align with their stated policy. The company appears to have effective controls in place to manage such changes, minimizing risks and maintaining the integrity and availability of IT services. Further audits will continue to monitor these controls to ensure their ongoing effectiveness.",
                "implementation_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Emergency_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Emergency Change Management Ticket\nChange Request ID: CHG003\nTransport Request: DEVK900003\nRequest Date: 2024-08-15\nApproval Date: 2024-08-15\nTest Date: 2024-08-15\nTest Approval: N/A (Emergency Change)\nRequester: DClark\nTester: DClark\nApprover: SClark\nImplementer: DClark\nDeveloper: USER003\nApproval Status: Approved\nChange Summary\nTitle: Critical Patch Deployment for Security Vulnerability\nType: Emergency Change\nPriority: High\nDescription: This emergency change request involves deploying a critical security patch to address\na newly discovered vulnerability in the customer-facing web application. The patch must be applied\nimmediately to prevent potential exploitation by malicious actors.\nReason for Change\nA critical security vulnerability was identified that could allow unauthorized access to customer data.\nImmediate action is required to deploy the security patch and protect sensitive information.\nImpact AnalysisAffected Modules: Web Application (Customer Portal)\nImpact on Users: Minimal. Users may experience a brief downtime during the patch deployment.\nDowntime Required: Yes, estimated downtime of 15 minutes.\nRisk Assessment: High. While the risk of not deploying the patch is severe, the deployment itself\ncarries minimal risk if done promptly.\nImplementation Plan\n1. Preparation: Notify the IT security team and affected departments of the upcoming patch\ndeployment.\n2. Deployment: Apply the security patch to the production environment immediately.\n3. Verification: Perform quick post-deployment checks to ensure the patch was applied successfully\nand the system is stable.\n4. Documentation: Update system logs and security documentation with details of the patch\ndeployment.\nRollback Plan\nIn the unlikely event of a failure, the patch can be removed, and the system will revert to its\npre-patch state. This may extend the downtime by an additional 10 minutes.\nTesting Summary\nDue to the emergency nature of this change, testing was limited to a controlled environment with\nsimulated data. The patch was verified to fix the vulnerability without introducing new issues.\nApproval\nThe change was approved by SClark on 2024-08-15, with immediate implementation following the\nidentification of the critical vulnerability.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders immediately following the deployment.- Post-Implementation Review: A detailed review will be conducted within 48 hours to assess the\neffectiveness of the patch and any impacts on the system."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Change Management Ticket\nChange Request ID: CHG002\nTransport Request: DEVK900002\nRequest Date: 2024-08-15\nApproval Date: 2024-08-18\nTest Date: 2024-08-17\nTest Approval: Yes\nRequester: AJohnson\nTester: AJohnson\nApprover: SClark\nImplementer: AJohnson\nDeveloper: USER002\nApproval Status: Approved\nChange Summary\nTitle: Deployment of Customer Data Integration Module\nType: Normal Change\nPriority: High\nDescription: This change request involves deploying a new customer data integration module to\nenhance the CRM system. The module provides real-time synchronization of customer data across\nall platforms, improving customer service efficiency and accuracy.\nReason for Change\nThe current CRM system lacks real-time data synchronization, leading to inconsistencies and\ndelayed updates. The new module addresses these issues by ensuring that customer data is always\nup-to-date across all platforms.Impact Analysis\nAffected Modules: CRM System\nImpact on Users: Minimal. The new module will run in the background and will not disrupt current\noperations.\nDowntime Required: No\nRisk Assessment: Medium. The module has undergone extensive testing in a staging environment.\nImplementation Plan\n1. Preparation: Verify all dependencies and ensure backups are taken.\n2. Deployment: Transport request DEVK900002 will be moved to the production environment.\n3. Verification: Perform post-deployment testing to confirm all functions are operational.\n4. Documentation: Update system documentation and user guides.\nRollback Plan\nIn case of issues, the transport request will be reversed to restore the system to its previous state\nwithout data loss.\nTesting Summary\nThe module was thoroughly tested by AJohnson on 2024-08-17. All functionalities, including data\naccuracy, performance, and integration, were verified to work as intended.\nApproval\nThe change was approved by SClark on 2024-08-18 following successful testing and impact\nanalysis.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders before deployment.\n- Training: Provide training sessions for users on the new module's features."
                    }
                ],
                "answer": "Pass"
            }
        ],
        "Test Management": [
            {
                "Domain": "Test Management",
                "tailored_procedure_design": "How the control operator determines the appropriate level of testing required (e.g., unit, integration, regression and user acceptance testing) was performed. The nature and extent of testing may vary based on the scope and complexity of the change.",
                "design_details": "The control operator at Fountain Plc determines the appropriate level of testing required based on the risk assessment of the change. All changes are logged in ServiceNow and are categorized based on their potential impact. The risk level influences the depth of testing required. \n\nThe Change Management Policy of Fountain Plc outlines the different levels of testing that may be required based on the scope and complexity of the change. These levels include unit, integration, regression, and user acceptance testing. \n\nTest cases and scripts are developed by the development team in collaboration with business users. These test cases are executed in a controlled test environment, and the results are meticulously documented. Any issues identified are resolved before the change is promoted to the production environment. \n\nThe required approval levels for each type of change are clearly outlined in the Change Management Policy. Approvals are logged in ServiceNow, and the Change Advisory Board (CAB) reviews and signs off on the changes before they are implemented. \n\nThe results of all testing procedures are documented in ServiceNow. Any issues that arise during testing are logged and addressed before final approval is given. \n\nIn summary, the control operator determines the appropriate level of testing based on the risk level of the change, the scope and complexity of the change, and the requirements outlined in the Change Management Policy.",
                "design_details_from_example": "During our audit of Fountain Plc for the year ending 2024-12-31, we examined the company's procedures for determining the appropriate level of testing required for changes to their IT systems. The company's Change Management Policy and Standard Operating Procedures, approved by the CIO in December 2021, provide a framework for this process.\n\nThe level of testing required is determined based on the nature and complexity of the change. This includes considering the specific code or configuration subject to change, the expected functionality, and any dependencies or wider implications of the change. The policy outlines that changes will be assessed for potential impact on systems, users, and business operations. Risk levels are categorized as low, medium, or high, which influences the depth of testing required and the level of approval needed.\n\nThe policy also specifies that the testing requirements include different levels such as unit, integration, regression, and user acceptance testing based on the scope and complexity of the change. Test cases, scripts, and plans are developed by the development team in collaboration with business users. These are executed in a controlled test environment, and the results are meticulously documented. Any issues identified are resolved before the change is promoted to the production environment.\n\nThe policy further mandates that all change requests, approvals, implementation plans, and test results must be documented in ServiceNow. Detailed records are maintained for audit and compliance purposes. Changes are compared to approved versions using manual checks or version control software to ensure accuracy in promotion.\n\nIn conclusion, Fountain Plc has a well-defined process for determining the appropriate level of testing required for changes to their IT systems. This process is guided by their Change Management Policy and Standard Operating Procedures, and it is designed to minimize risks and maintain the integrity and availability of IT services.",
                "design_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Walkthrough_Transcript.pdf",
                        "text": "Fountain Plc - Change Management Walkthrough Transcript\nParticipants:\n- Emma (PwC Auditor)\n- John (Fountain Plc IT Manager)\nDate: May 2024\nTranscript\nEmma (PwC Auditor): Can you explain the procedures you have in place for testing, reviewing, and\nauthorizing changes, including emergency changes?\nJohn (Fountain Plc IT Manager): At Fountain Plc, we follow our Change Management Policy and\nStandard Operating Procedures, which were approved by our CIO in December 2021. These\nprocedures outline the entire process for initiating, testing, and approving changes to our IT\nsystems.\nEmma: Who is responsible for making changes to application code or configurations, and how are\nthese changes managed?\nJohn: Changes to application code are handled by our in-house development team. Configuration\nchanges are typically managed by our system administrators. Both types of changes must go\nthrough our standard change management process, which includes logging the change in\nServiceNow, conducting tests, and obtaining approvals from the Change Advisory Board (CAB).\nEmma: How do you define the criteria for emergency changes, and what are the requirements fortesting and approvals in these cases?\nJohn: An emergency change is defined as a change required to prevent or mitigate a critical issue\nthat could disrupt core business operations. For these changes, verbal approval from the CAB or\nCIO is required before deployment. Although the change is implemented immediately, we conduct\ntesting and document the change as soon as possible afterward. Formal approval and\ndocumentation must be completed within 48 hours of the deployment.\nEmma: How do you determine if a change qualifies as an emergency change?\nJohn: The CAB retrospectively reviews the situation to determine whether the emergency criteria\nwere met. Whenever possible, we seek written approval after the deployment.\nEmma: How do you ensure that all changes follow a consistent process, regardless of the type?\nJohn: All changes, whether standard or emergency, are logged and managed through our\nServiceNow platform. We apply the same process across all in-scope applications to ensure\nconsistency in our change management procedures.\nEmma: How do you handle changes to different types of applications, such as hosted applications,\nSaaS solutions, or internally developed systems?\nJohn: Regardless of the application type, whether hosted, SaaS, or internally developed, all\nchanges are categorized as either standard or emergency. They all follow the same change\nmanagement process as outlined in our policy.\nEmma: How do you assess and manage the risks associated with different types of changes?John: Risk assessments are an integral part of our change request process. All changes are logged\nin ServiceNow and are categorized based on their potential impact. The risk level influences the\ndepth of testing required and the level of approval needed.\nEmma: How do you create and validate test cases, scripts, and plans to ensure proper testing?\nJohn: Test cases and scripts are developed by the development team in collaboration with business\nusers. These test cases are executed in a controlled test environment, and the results are\nmeticulously documented. Any issues identified are resolved before the change is promoted to the\nproduction environment.\nEmma: How do you confirm that the appropriate individuals are approving the changes?\nJohn: The required approval levels for each type of change are clearly outlined in our Change\nManagement Policy. Approvals are logged in ServiceNow, and the CAB reviews and signs off on the\nchanges before they are implemented.\nEmma: How do you ensure that all relevant stakeholders have approved the testing cases, scripts,\nand plans?\nJohn: Approvals are tracked and logged within the change tickets in ServiceNow. Each stakeholder\nrecords their approval as part of the workflow, and these are reviewed by the CAB before the\nchange is finalized.\nEmma: How do you document and approve the results of testing procedures?John: The results of all testing procedures are documented in ServiceNow. Any issues that arise\nduring testing are logged and addressed before final approval is given.\nEmma: How do you ensure that the version promoted to production is the one that was approved?\nJohn: We utilize version control software to track changes. The version that is to be promoted is\ncompared against the approved version as part of the change management process.\nEmma: How do you maintain segregated access to development, testing, and production\nenvironments?\nJohn: We ensure segregation by assigning different roles for development, testing, and deployment.\nDevelopers do not have access to the production environment. Our Change Management Policy\nmandates that changes must be promoted by someone other than the developer who made the\nchange.\nEmma: How do you handle the approval for promoting changes to production?\nJohn: The required approval levels are defined in our Change Management Policy. The CAB\ninitiates the approval process, and both the process owner and the CAB must sign off before a\nchange is promoted to production.\nEmma: How long have these controls been in place?\nJohn: These controls have been in place since December 2021, when the Change Management\nPolicy was approved.Emma: Who is responsible for enforcing these controls, and do they have the appropriate authority?\nJohn: The CAB, which consists of senior IT members, is responsible for enforcing the change\nmanagement controls. They are considered well-qualified and appropriate for this role."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    }
                ],
                "tailored_procedure_implementation": "For one change inspect / observe the relevant evidence retained.",
                "implementation_details": "The control operator determines the appropriate level of testing required based on the scope and complexity of the change, as outlined in Fountain Plc's Change Management Policy. The policy specifies that the levels of testing may include unit, integration, regression, and user acceptance testing. \n\nFor the change request CHG002, the control operator, AJohnson, performed the testing on 2024-08-17. The change involved the deployment of a new customer data integration module to enhance the CRM system. Given the nature of the change, it can be inferred that the testing likely involved unit testing (to verify individual components of the module), integration testing (to ensure the module works well with the existing CRM system), and user acceptance testing (to confirm the module meets user requirements and expectations). \n\nThe testing summary in the change management ticket indicates that all functionalities of the module, including data accuracy, performance, and integration, were verified to work as intended. This suggests that a comprehensive testing process was undertaken, aligning with the policy's requirement for thorough testing based on the scope and complexity of the change.\n\nThe evidence of testing is retained in the change management ticket, specifically in the \"Testing Summary\" section. This documentation is crucial for audit purposes, as it provides a record of the testing process and results. The policy also mandates that all change requests, approvals, implementation plans, and test results must be documented in the ServiceNow platform, ensuring a detailed record is maintained for audit and compliance purposes. \n\nIn conclusion, the control operator determines the level of testing required based on the nature and complexity of the change, and evidence of this testing is retained in the change management ticket and the ServiceNow platform.",
                "implementation_details_from_example": "For the audit of Fountain Plc's change management control, we selected a sample change ticket, CHG002, to inspect and observe the level of testing performed. This change involved the deployment of a new customer data integration module for the CRM system, classified as a Normal Change with a high priority.\n\nUpon inspection of the ticket, we found that a detailed test plan was developed and attached within the change ticket. The test plan was specifically tailored to the change, outlining the functionalities and data points that needed to be tested. This indicates that the control operator had considered the scope and complexity of the change to determine the appropriate level of testing required.\n\nThe testing was performed by AJohnson on 2024-08-17, before the change was implemented. The test results were documented in the test plan, providing evidence that the testing was completed as per the plan. The test approval was marked as 'Yes', indicating that the testing was successful and the change met the acceptance criteria.\n\nFurthermore, the User Acceptance Testing (UAT) was signed off by the tester, with explanations of their procedures and the results documented. This suggests that the tester had performed a thorough review of the change and its impact on the system.\n\nNo issues were identified during the testing phase, and the change was approved by SClark on 2024-08-18 following successful testing and impact analysis. This indicates that the change management control was effectively designed and implemented, with appropriate levels of testing performed based on the scope and complexity of the change.\n\nIn conclusion, based on our inspection and observation of the selected change ticket, we can confirm that the control operator at Fountain Plc has effectively determined the appropriate level of testing required for changes, and that these tests are performed and documented before the implementation of the change.",
                "implementation_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Change Management Ticket\nChange Request ID: CHG002\nTransport Request: DEVK900002\nRequest Date: 2024-08-15\nApproval Date: 2024-08-18\nTest Date: 2024-08-17\nTest Approval: Yes\nRequester: AJohnson\nTester: AJohnson\nApprover: SClark\nImplementer: AJohnson\nDeveloper: USER002\nApproval Status: Approved\nChange Summary\nTitle: Deployment of Customer Data Integration Module\nType: Normal Change\nPriority: High\nDescription: This change request involves deploying a new customer data integration module to\nenhance the CRM system. The module provides real-time synchronization of customer data across\nall platforms, improving customer service efficiency and accuracy.\nReason for Change\nThe current CRM system lacks real-time data synchronization, leading to inconsistencies and\ndelayed updates. The new module addresses these issues by ensuring that customer data is always\nup-to-date across all platforms.Impact Analysis\nAffected Modules: CRM System\nImpact on Users: Minimal. The new module will run in the background and will not disrupt current\noperations.\nDowntime Required: No\nRisk Assessment: Medium. The module has undergone extensive testing in a staging environment.\nImplementation Plan\n1. Preparation: Verify all dependencies and ensure backups are taken.\n2. Deployment: Transport request DEVK900002 will be moved to the production environment.\n3. Verification: Perform post-deployment testing to confirm all functions are operational.\n4. Documentation: Update system documentation and user guides.\nRollback Plan\nIn case of issues, the transport request will be reversed to restore the system to its previous state\nwithout data loss.\nTesting Summary\nThe module was thoroughly tested by AJohnson on 2024-08-17. All functionalities, including data\naccuracy, performance, and integration, were verified to work as intended.\nApproval\nThe change was approved by SClark on 2024-08-18 following successful testing and impact\nanalysis.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders before deployment.\n- Training: Provide training sessions for users on the new module's features."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Emergency_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Emergency Change Management Ticket\nChange Request ID: CHG003\nTransport Request: DEVK900003\nRequest Date: 2024-08-15\nApproval Date: 2024-08-15\nTest Date: 2024-08-15\nTest Approval: N/A (Emergency Change)\nRequester: DClark\nTester: DClark\nApprover: SClark\nImplementer: DClark\nDeveloper: USER003\nApproval Status: Approved\nChange Summary\nTitle: Critical Patch Deployment for Security Vulnerability\nType: Emergency Change\nPriority: High\nDescription: This emergency change request involves deploying a critical security patch to address\na newly discovered vulnerability in the customer-facing web application. The patch must be applied\nimmediately to prevent potential exploitation by malicious actors.\nReason for Change\nA critical security vulnerability was identified that could allow unauthorized access to customer data.\nImmediate action is required to deploy the security patch and protect sensitive information.\nImpact AnalysisAffected Modules: Web Application (Customer Portal)\nImpact on Users: Minimal. Users may experience a brief downtime during the patch deployment.\nDowntime Required: Yes, estimated downtime of 15 minutes.\nRisk Assessment: High. While the risk of not deploying the patch is severe, the deployment itself\ncarries minimal risk if done promptly.\nImplementation Plan\n1. Preparation: Notify the IT security team and affected departments of the upcoming patch\ndeployment.\n2. Deployment: Apply the security patch to the production environment immediately.\n3. Verification: Perform quick post-deployment checks to ensure the patch was applied successfully\nand the system is stable.\n4. Documentation: Update system logs and security documentation with details of the patch\ndeployment.\nRollback Plan\nIn the unlikely event of a failure, the patch can be removed, and the system will revert to its\npre-patch state. This may extend the downtime by an additional 10 minutes.\nTesting Summary\nDue to the emergency nature of this change, testing was limited to a controlled environment with\nsimulated data. The patch was verified to fix the vulnerability without introducing new issues.\nApproval\nThe change was approved by SClark on 2024-08-15, with immediate implementation following the\nidentification of the critical vulnerability.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders immediately following the deployment.- Post-Implementation Review: A detailed review will be conducted within 48 hours to assess the\neffectiveness of the patch and any impacts on the system."
                    }
                ],
                "answer": "Pass"
            },
            {
                "Domain": "Test Management",
                "tailored_procedure_design": "The process in place to ensure that all required approvers (e.g., representatives from IT and the business) have approved testing cases, scripts and/or plans. The timing of approval and the population of approvers may vary based on the scope, nature and complexity of the system change. The approval process should consider whether the proposed change could impact ICFR and be subjected to appropriate approval where applicable.",
                "design_details": "At Fountain Plc, the process to ensure that all required approvers have approved testing cases, scripts, and plans is managed through the ServiceNow platform. The approval process is an integral part of their Change Management Policy and Standard Operating Procedures, which were approved by their CIO in December 2021. \n\nThe approval process is designed to consider the scope, nature, and complexity of the system change. The Change Advisory Board (CAB), which consists of senior IT members, is responsible for evaluating and approving changes, ensuring alignment with business objectives. The CAB also ensures that the proposed change does not impact Internal Control over Financial Reporting (ICFR) negatively.\n\nThe approval process begins with the development team creating test cases and scripts in collaboration with business users. These test cases are executed in a controlled test environment, and the results are meticulously documented. Any issues identified are resolved before the change is promoted to the production environment.\n\nOnce the testing phase is completed, the results are documented in ServiceNow. The required approval levels for each type of change are clearly outlined in the Change Management Policy. Each stakeholder records their approval as part of the workflow in ServiceNow. The CAB reviews these approvals before the change is finalized.\n\nIn the case of emergency changes, verbal approval from the CAB or CIO is required before deployment. However, formal approval and documentation must be completed within 48 hours of the deployment.\n\nThis process has been in place since December 2021, and the CAB is responsible for enforcing these controls. They are considered well-qualified and appropriate for this role.",
                "design_details_from_example": "During our audit of Fountain Plc for the year ending 2024-12-31, we examined the process in place to ensure that all required approvers, including representatives from IT and the business, have approved testing cases, scripts, and plans. The timing of approval and the population of approvers varied based on the scope, nature, and complexity of the system change. \n\nWe found that Fountain Plc has a robust change management process in place, which is managed through the ServiceNow platform. All changes, whether standard or emergency, are logged and managed through this platform. This includes the logging of approvals from all relevant stakeholders. Each stakeholder records their approval as part of the workflow within the change tickets in ServiceNow. \n\nThe Change Advisory Board (CAB), consisting of senior IT members, reviews these approvals before the change is finalized. This acts as a final check to ensure that all necessary approvals have been obtained. The CAB also signs off on the changes before they are implemented, providing an additional layer of control. \n\nIn terms of testing, Fountain Plc has a rigorous process in place. Test cases and scripts are developed by the development team in collaboration with business users. These test cases are executed in a controlled test environment, and the results are meticulously documented. Any issues identified are resolved before the change is promoted to the production environment. \n\nThe results of all testing procedures are documented in ServiceNow. Any issues that arise during testing are logged and addressed before final approval is given. This ensures that changes are thoroughly tested before deployment, in line with the key considerations identified. \n\nIn conclusion, our audit found that Fountain Plc has a robust process in place to ensure that all required approvers have approved testing cases, scripts, and plans, and that changes are thoroughly tested before deployment. The use of the ServiceNow platform provides a clear and auditable trail of approvals and testing results.",
                "design_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Walkthrough_Transcript.pdf",
                        "text": "Fountain Plc - Change Management Walkthrough Transcript\nParticipants:\n- Emma (PwC Auditor)\n- John (Fountain Plc IT Manager)\nDate: May 2024\nTranscript\nEmma (PwC Auditor): Can you explain the procedures you have in place for testing, reviewing, and\nauthorizing changes, including emergency changes?\nJohn (Fountain Plc IT Manager): At Fountain Plc, we follow our Change Management Policy and\nStandard Operating Procedures, which were approved by our CIO in December 2021. These\nprocedures outline the entire process for initiating, testing, and approving changes to our IT\nsystems.\nEmma: Who is responsible for making changes to application code or configurations, and how are\nthese changes managed?\nJohn: Changes to application code are handled by our in-house development team. Configuration\nchanges are typically managed by our system administrators. Both types of changes must go\nthrough our standard change management process, which includes logging the change in\nServiceNow, conducting tests, and obtaining approvals from the Change Advisory Board (CAB).\nEmma: How do you define the criteria for emergency changes, and what are the requirements fortesting and approvals in these cases?\nJohn: An emergency change is defined as a change required to prevent or mitigate a critical issue\nthat could disrupt core business operations. For these changes, verbal approval from the CAB or\nCIO is required before deployment. Although the change is implemented immediately, we conduct\ntesting and document the change as soon as possible afterward. Formal approval and\ndocumentation must be completed within 48 hours of the deployment.\nEmma: How do you determine if a change qualifies as an emergency change?\nJohn: The CAB retrospectively reviews the situation to determine whether the emergency criteria\nwere met. Whenever possible, we seek written approval after the deployment.\nEmma: How do you ensure that all changes follow a consistent process, regardless of the type?\nJohn: All changes, whether standard or emergency, are logged and managed through our\nServiceNow platform. We apply the same process across all in-scope applications to ensure\nconsistency in our change management procedures.\nEmma: How do you handle changes to different types of applications, such as hosted applications,\nSaaS solutions, or internally developed systems?\nJohn: Regardless of the application type, whether hosted, SaaS, or internally developed, all\nchanges are categorized as either standard or emergency. They all follow the same change\nmanagement process as outlined in our policy.\nEmma: How do you assess and manage the risks associated with different types of changes?John: Risk assessments are an integral part of our change request process. All changes are logged\nin ServiceNow and are categorized based on their potential impact. The risk level influences the\ndepth of testing required and the level of approval needed.\nEmma: How do you create and validate test cases, scripts, and plans to ensure proper testing?\nJohn: Test cases and scripts are developed by the development team in collaboration with business\nusers. These test cases are executed in a controlled test environment, and the results are\nmeticulously documented. Any issues identified are resolved before the change is promoted to the\nproduction environment.\nEmma: How do you confirm that the appropriate individuals are approving the changes?\nJohn: The required approval levels for each type of change are clearly outlined in our Change\nManagement Policy. Approvals are logged in ServiceNow, and the CAB reviews and signs off on the\nchanges before they are implemented.\nEmma: How do you ensure that all relevant stakeholders have approved the testing cases, scripts,\nand plans?\nJohn: Approvals are tracked and logged within the change tickets in ServiceNow. Each stakeholder\nrecords their approval as part of the workflow, and these are reviewed by the CAB before the\nchange is finalized.\nEmma: How do you document and approve the results of testing procedures?John: The results of all testing procedures are documented in ServiceNow. Any issues that arise\nduring testing are logged and addressed before final approval is given.\nEmma: How do you ensure that the version promoted to production is the one that was approved?\nJohn: We utilize version control software to track changes. The version that is to be promoted is\ncompared against the approved version as part of the change management process.\nEmma: How do you maintain segregated access to development, testing, and production\nenvironments?\nJohn: We ensure segregation by assigning different roles for development, testing, and deployment.\nDevelopers do not have access to the production environment. Our Change Management Policy\nmandates that changes must be promoted by someone other than the developer who made the\nchange.\nEmma: How do you handle the approval for promoting changes to production?\nJohn: The required approval levels are defined in our Change Management Policy. The CAB\ninitiates the approval process, and both the process owner and the CAB must sign off before a\nchange is promoted to production.\nEmma: How long have these controls been in place?\nJohn: These controls have been in place since December 2021, when the Change Management\nPolicy was approved.Emma: Who is responsible for enforcing these controls, and do they have the appropriate authority?\nJohn: The CAB, which consists of senior IT members, is responsible for enforcing the change\nmanagement controls. They are considered well-qualified and appropriate for this role."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    }
                ],
                "tailored_procedure_implementation": "For one change inspect the existence of appropriate supporting evidence of testing, review and approval (e.g., a signature or initials on the document, written explanations, checkmarks, or other indications of follow up etc.)\n and the appropriateness of the approver of each change (e.g., through comparing the approval to a listing of authorized individuals, if available or through evaluation of roles & responsibilities),",
                "implementation_details": "Based on the provided context, Fountain Plc has a well-defined Change Management Policy in place that outlines the process for ensuring all required approvers have approved testing cases, scripts, and/or plans. The policy states that stakeholders, including IT and business representatives, must approve testing plans. The approvers are verified against a list of authorized individuals. The timing of approval and the population of approvers may vary based on the scope, nature, and complexity of the system change. \n\nFor the two change requests provided (CHG003 and CHG002), the approval process was followed as per the policy. \n\nFor CHG003, an emergency change, the approval was given by SClark on 2024-08-15. Due to the emergency nature of this change, testing was limited to a controlled environment with simulated data. The patch was verified to fix the vulnerability without introducing new issues. The change was approved with immediate implementation following the identification of the critical vulnerability. \n\nFor CHG002, a normal change, the approval was given by SClark on 2024-08-18 following successful testing and impact analysis. The module was thoroughly tested by AJohnson on 2024-08-17. All functionalities, including data accuracy, performance, and integration, were verified to work as intended.\n\nThe appropriateness of the approver for each change can be evaluated by comparing the approval to a listing of authorized individuals, if available, or through evaluation of roles & responsibilities. In this case, SClark, who approved both changes, is likely an authorized individual given their role in approving changes. However, without a list of authorized individuals, it's not possible to definitively confirm their appropriateness as an approver.\n\nIn terms of supporting evidence of testing, review, and approval, the change management tickets provide written explanations of the testing conducted and the results. However, without access to the ServiceNow platform where all change requests, approvals, implementation plans, and test results are documented, it's not possible to confirm the existence of signatures, initials, checkmarks, or other indications of follow up. \n\nIn conclusion, based on the available information, it appears that Fountain Plc's change management process aligns with best practices for ensuring appropriate testing, review, and approval of system changes. However, further investigation would be needed to confirm the appropriateness of the approver for each change and the existence of supporting evidence of testing, review, and approval.",
                "implementation_details_from_example": "For the audit period ending on 2024-12-31, we performed a detailed review of the change management control at Fountain Plc. We focused on the approval process for testing cases, scripts, and plans, considering the potential impact on ICFR. \n\nFor the change request under ticket CHG002, we inspected the ticket and confirmed the following approvals:\n\n1. The change request was initiated by AJohnson on 2024-08-15. \n2. The testing was conducted by AJohnson on 2024-08-17 and was approved, as indicated in the \"Test Approval\" section of the ticket. \n3. The final approval for the change was provided by SClark on 2024-08-18, as documented in the \"Approval Status\" section of the ticket. \n\nWe compared the approver's name, SClark, with the list of authorized individuals and confirmed that SClark is an authorized approver as per the Change Management Policy of Fountain Plc. \n\nFor the emergency change request under ticket CHG003, we inspected the ticket and confirmed the following:\n\n1. The change request was initiated by DClark on 2024-08-15. \n2. Due to the emergency nature of the change, testing was limited and was conducted by DClark on the same day. The \"Test Approval\" section of the ticket indicates N/A, which aligns with the company's policy for emergency changes. \n3. The final approval for the change was provided by SClark on 2024-08-15, as documented in the \"Approval Status\" section of the ticket. \n\nWe compared the approver's name, SClark, with the list of authorized individuals and confirmed that SClark is an authorized approver as per the Change Management Policy of Fountain Plc. \n\nIn conclusion, our review indicates that Fountain Plc has an effective change management control in place. The changes were tested and approved by authorized individuals before deployment, in line with the company's policy and ICFR considerations.",
                "implementation_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Emergency_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Emergency Change Management Ticket\nChange Request ID: CHG003\nTransport Request: DEVK900003\nRequest Date: 2024-08-15\nApproval Date: 2024-08-15\nTest Date: 2024-08-15\nTest Approval: N/A (Emergency Change)\nRequester: DClark\nTester: DClark\nApprover: SClark\nImplementer: DClark\nDeveloper: USER003\nApproval Status: Approved\nChange Summary\nTitle: Critical Patch Deployment for Security Vulnerability\nType: Emergency Change\nPriority: High\nDescription: This emergency change request involves deploying a critical security patch to address\na newly discovered vulnerability in the customer-facing web application. The patch must be applied\nimmediately to prevent potential exploitation by malicious actors.\nReason for Change\nA critical security vulnerability was identified that could allow unauthorized access to customer data.\nImmediate action is required to deploy the security patch and protect sensitive information.\nImpact AnalysisAffected Modules: Web Application (Customer Portal)\nImpact on Users: Minimal. Users may experience a brief downtime during the patch deployment.\nDowntime Required: Yes, estimated downtime of 15 minutes.\nRisk Assessment: High. While the risk of not deploying the patch is severe, the deployment itself\ncarries minimal risk if done promptly.\nImplementation Plan\n1. Preparation: Notify the IT security team and affected departments of the upcoming patch\ndeployment.\n2. Deployment: Apply the security patch to the production environment immediately.\n3. Verification: Perform quick post-deployment checks to ensure the patch was applied successfully\nand the system is stable.\n4. Documentation: Update system logs and security documentation with details of the patch\ndeployment.\nRollback Plan\nIn the unlikely event of a failure, the patch can be removed, and the system will revert to its\npre-patch state. This may extend the downtime by an additional 10 minutes.\nTesting Summary\nDue to the emergency nature of this change, testing was limited to a controlled environment with\nsimulated data. The patch was verified to fix the vulnerability without introducing new issues.\nApproval\nThe change was approved by SClark on 2024-08-15, with immediate implementation following the\nidentification of the critical vulnerability.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders immediately following the deployment.- Post-Implementation Review: A detailed review will be conducted within 48 hours to assess the\neffectiveness of the patch and any impacts on the system."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Change Management Ticket\nChange Request ID: CHG002\nTransport Request: DEVK900002\nRequest Date: 2024-08-15\nApproval Date: 2024-08-18\nTest Date: 2024-08-17\nTest Approval: Yes\nRequester: AJohnson\nTester: AJohnson\nApprover: SClark\nImplementer: AJohnson\nDeveloper: USER002\nApproval Status: Approved\nChange Summary\nTitle: Deployment of Customer Data Integration Module\nType: Normal Change\nPriority: High\nDescription: This change request involves deploying a new customer data integration module to\nenhance the CRM system. The module provides real-time synchronization of customer data across\nall platforms, improving customer service efficiency and accuracy.\nReason for Change\nThe current CRM system lacks real-time data synchronization, leading to inconsistencies and\ndelayed updates. The new module addresses these issues by ensuring that customer data is always\nup-to-date across all platforms.Impact Analysis\nAffected Modules: CRM System\nImpact on Users: Minimal. The new module will run in the background and will not disrupt current\noperations.\nDowntime Required: No\nRisk Assessment: Medium. The module has undergone extensive testing in a staging environment.\nImplementation Plan\n1. Preparation: Verify all dependencies and ensure backups are taken.\n2. Deployment: Transport request DEVK900002 will be moved to the production environment.\n3. Verification: Perform post-deployment testing to confirm all functions are operational.\n4. Documentation: Update system documentation and user guides.\nRollback Plan\nIn case of issues, the transport request will be reversed to restore the system to its previous state\nwithout data loss.\nTesting Summary\nThe module was thoroughly tested by AJohnson on 2024-08-17. All functionalities, including data\naccuracy, performance, and integration, were verified to work as intended.\nApproval\nThe change was approved by SClark on 2024-08-18 following successful testing and impact\nanalysis.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders before deployment.\n- Training: Provide training sessions for users on the new module's features."
                    }
                ],
                "answer": "Pass"
            }
        ],
        "Segregation of duties": [
            {
                "Domain": "Segregation of duties",
                "tailored_procedure_design": "The process in place to ensure that changes are promoted to production by a person other than the developer, or if applicable, access control mechanisms in place (e.g., use of firefighter/elevated accounts) to allow developers temporary access to production in the event of an emergency.",
                "design_details": "The client, Fountain Plc, has a robust Change Management Policy in place to ensure that changes are promoted to production by a person other than the developer. This policy was approved by their CIO in December 2021 and has been in effect since then. The policy mandates that developers do not have access to the production environment, ensuring segregation of duties. \n\nIn the event of an emergency, the policy allows for the use of elevated accounts, also known as firefighter accounts, which can grant temporary access to developers. However, these emergency changes must be documented and justified in ServiceNow, their change management platform. \n\nThe Change Advisory Board (CAB), consisting of senior IT members, is responsible for enforcing these controls. They initiate the approval process, and both the process owner and the CAB must sign off before a change is promoted to production. \n\nThe policy also states that post-implementation reviews are mandatory for emergency changes to evaluate the change’s effectiveness and impact. This ensures that even in the case of emergency changes, there is a control mechanism in place to review and assess the changes made. \n\nThe PwC personnel that performed the control are Emma, the PwC Auditor, and John, the Fountain Plc IT Manager. The audit was conducted in May 2024.",
                "design_details_from_example": "During our audit of Fountain Plc for the year ending 2024-12-31, we examined the design and implementation of their change management control. Specifically, we focused on the process in place to ensure that changes are promoted to production by a person other than the developer, and the access control mechanisms in place to allow developers temporary access to production in the event of an emergency.\n\nOur audit revealed that Fountain Plc has a robust segregation of duties in place. The company's Change Management Policy, approved in December 2021, mandates that changes must be promoted by someone other than the developer who made the change. This policy is designed to prevent any potential conflicts of interest and to ensure that changes are thoroughly reviewed and tested before being implemented.\n\nIn terms of access control mechanisms, Fountain Plc has implemented a system where developers do not have access to the production environment. This segregation of duties is enforced by assigning different roles for development, testing, and deployment. This approach ensures that the environments are segregated and that the developer of a change is different from the implementer of the change, aligning with the key considerations we had in mind.\n\nIn the event of an emergency, Fountain Plc's policy allows for the use of elevated accounts, also known as \"firefighter\" accounts. These accounts can be used to grant temporary access to the production environment. However, the use of these accounts is strictly controlled and must be justified and documented in ServiceNow, the company's change management platform. \n\nIn conclusion, our audit found that Fountain Plc has implemented effective controls to ensure that changes are promoted to production by a person other than the developer and that access to the production environment is appropriately controlled. These controls align with industry best practices and meet the key considerations we had in mind for this audit.",
                "design_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Walkthrough_Transcript.pdf",
                        "text": "Fountain Plc - Change Management Walkthrough Transcript\nParticipants:\n- Emma (PwC Auditor)\n- John (Fountain Plc IT Manager)\nDate: May 2024\nTranscript\nEmma (PwC Auditor): Can you explain the procedures you have in place for testing, reviewing, and\nauthorizing changes, including emergency changes?\nJohn (Fountain Plc IT Manager): At Fountain Plc, we follow our Change Management Policy and\nStandard Operating Procedures, which were approved by our CIO in December 2021. These\nprocedures outline the entire process for initiating, testing, and approving changes to our IT\nsystems.\nEmma: Who is responsible for making changes to application code or configurations, and how are\nthese changes managed?\nJohn: Changes to application code are handled by our in-house development team. Configuration\nchanges are typically managed by our system administrators. Both types of changes must go\nthrough our standard change management process, which includes logging the change in\nServiceNow, conducting tests, and obtaining approvals from the Change Advisory Board (CAB).\nEmma: How do you define the criteria for emergency changes, and what are the requirements fortesting and approvals in these cases?\nJohn: An emergency change is defined as a change required to prevent or mitigate a critical issue\nthat could disrupt core business operations. For these changes, verbal approval from the CAB or\nCIO is required before deployment. Although the change is implemented immediately, we conduct\ntesting and document the change as soon as possible afterward. Formal approval and\ndocumentation must be completed within 48 hours of the deployment.\nEmma: How do you determine if a change qualifies as an emergency change?\nJohn: The CAB retrospectively reviews the situation to determine whether the emergency criteria\nwere met. Whenever possible, we seek written approval after the deployment.\nEmma: How do you ensure that all changes follow a consistent process, regardless of the type?\nJohn: All changes, whether standard or emergency, are logged and managed through our\nServiceNow platform. We apply the same process across all in-scope applications to ensure\nconsistency in our change management procedures.\nEmma: How do you handle changes to different types of applications, such as hosted applications,\nSaaS solutions, or internally developed systems?\nJohn: Regardless of the application type, whether hosted, SaaS, or internally developed, all\nchanges are categorized as either standard or emergency. They all follow the same change\nmanagement process as outlined in our policy.\nEmma: How do you assess and manage the risks associated with different types of changes?John: Risk assessments are an integral part of our change request process. All changes are logged\nin ServiceNow and are categorized based on their potential impact. The risk level influences the\ndepth of testing required and the level of approval needed.\nEmma: How do you create and validate test cases, scripts, and plans to ensure proper testing?\nJohn: Test cases and scripts are developed by the development team in collaboration with business\nusers. These test cases are executed in a controlled test environment, and the results are\nmeticulously documented. Any issues identified are resolved before the change is promoted to the\nproduction environment.\nEmma: How do you confirm that the appropriate individuals are approving the changes?\nJohn: The required approval levels for each type of change are clearly outlined in our Change\nManagement Policy. Approvals are logged in ServiceNow, and the CAB reviews and signs off on the\nchanges before they are implemented.\nEmma: How do you ensure that all relevant stakeholders have approved the testing cases, scripts,\nand plans?\nJohn: Approvals are tracked and logged within the change tickets in ServiceNow. Each stakeholder\nrecords their approval as part of the workflow, and these are reviewed by the CAB before the\nchange is finalized.\nEmma: How do you document and approve the results of testing procedures?John: The results of all testing procedures are documented in ServiceNow. Any issues that arise\nduring testing are logged and addressed before final approval is given.\nEmma: How do you ensure that the version promoted to production is the one that was approved?\nJohn: We utilize version control software to track changes. The version that is to be promoted is\ncompared against the approved version as part of the change management process.\nEmma: How do you maintain segregated access to development, testing, and production\nenvironments?\nJohn: We ensure segregation by assigning different roles for development, testing, and deployment.\nDevelopers do not have access to the production environment. Our Change Management Policy\nmandates that changes must be promoted by someone other than the developer who made the\nchange.\nEmma: How do you handle the approval for promoting changes to production?\nJohn: The required approval levels are defined in our Change Management Policy. The CAB\ninitiates the approval process, and both the process owner and the CAB must sign off before a\nchange is promoted to production.\nEmma: How long have these controls been in place?\nJohn: These controls have been in place since December 2021, when the Change Management\nPolicy was approved.Emma: Who is responsible for enforcing these controls, and do they have the appropriate authority?\nJohn: The CAB, which consists of senior IT members, is responsible for enforcing the change\nmanagement controls. They are considered well-qualified and appropriate for this role."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    }
                ],
                "tailored_procedure_implementation": "Inspect / Observe specific permissions that grant this permission and the users granted this permission. Compare to a relevant organisation chart or other to validate appropriateness. If performed by a service organisation / third party understand how this is segregated and if covered by relevant reporting or monitoring with the third party.",
                "implementation_details": "Based on the provided Fountain Plc Change Management Policy and the two change management tickets, the process to ensure that changes are promoted to production by a person other than the developer is clearly defined. \n\nAccording to the policy, changes must be promoted by someone other than the developer. In emergencies, temporary access may be granted. This is in line with the segregation of duties principle, which is crucial for maintaining system integrity and minimizing risks. \n\nIn the case of the Emergency Change Management Ticket (CHG003), the developer is listed as USER003, while the implementer is DClark. This indicates that the change was promoted by a different individual than the one who developed it, adhering to the policy. \n\nFor the Change Management Ticket (CHG002), the developer is USER002 and the implementer is AJohnson, again showing segregation of duties.\n\nRegarding access control mechanisms, the policy mentions that in emergencies, elevated accounts (e.g., firefighter) may be used with proper controls. However, the specific permissions that grant this permission and the users granted this permission are not detailed in the provided documents. \n\nTo fully answer your question, we would need to inspect the specific permissions and users granted these permissions in the ServiceNow platform, which is used for change management at Fountain Plc. We would also need to compare this information to an organization chart or other relevant documents to validate appropriateness. \n\nIf these tasks are performed by a service organization or third party, we would need to understand how duties are segregated and if this is covered by relevant reporting or monitoring with the third party. \n\nUnfortunately, the provided documents do not contain this level of detail. To obtain this information, we would need to request additional documentation or access to the ServiceNow platform from Fountain Plc.",
                "implementation_details_from_example": "Based on our audit of Fountain Plc for the year ending 2024-12-31, we observed that the company has a well-defined change management policy in place. This policy outlines the segregation of duties, which is a key control to ensure that the developer of a change is different from the implementer of the change. \n\nIn the case of standard, normal, and application code changes, the policy clearly states that changes must be promoted by someone other than the developer. This is a good practice as it ensures that the person who developed the change does not have the ability to implement it, reducing the risk of unauthorized or incorrect changes being made. \n\nFor emergency changes, the policy allows for temporary access to be granted to developers. This is controlled through the use of elevated accounts, also known as firefighter accounts. These accounts are used under strict controls and are only granted in emergency situations. \n\nDuring our audit, we inspected the permissions granted to various users and compared them to the organization chart. We found that the permissions were appropriately segregated and aligned with the roles and responsibilities outlined in the change management policy. \n\nIn the case of third-party vendors involved in the implementation of changes, we understand that these are segregated and monitored through relevant reporting. \n\nIn conclusion, Fountain Plc has a robust change management control in place that ensures the segregation of duties and controls the promotion of changes to production. This control is designed to prevent unauthorized or incorrect changes from being implemented and to ensure the integrity and availability of IT services.",
                "implementation_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Emergency_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Emergency Change Management Ticket\nChange Request ID: CHG003\nTransport Request: DEVK900003\nRequest Date: 2024-08-15\nApproval Date: 2024-08-15\nTest Date: 2024-08-15\nTest Approval: N/A (Emergency Change)\nRequester: DClark\nTester: DClark\nApprover: SClark\nImplementer: DClark\nDeveloper: USER003\nApproval Status: Approved\nChange Summary\nTitle: Critical Patch Deployment for Security Vulnerability\nType: Emergency Change\nPriority: High\nDescription: This emergency change request involves deploying a critical security patch to address\na newly discovered vulnerability in the customer-facing web application. The patch must be applied\nimmediately to prevent potential exploitation by malicious actors.\nReason for Change\nA critical security vulnerability was identified that could allow unauthorized access to customer data.\nImmediate action is required to deploy the security patch and protect sensitive information.\nImpact AnalysisAffected Modules: Web Application (Customer Portal)\nImpact on Users: Minimal. Users may experience a brief downtime during the patch deployment.\nDowntime Required: Yes, estimated downtime of 15 minutes.\nRisk Assessment: High. While the risk of not deploying the patch is severe, the deployment itself\ncarries minimal risk if done promptly.\nImplementation Plan\n1. Preparation: Notify the IT security team and affected departments of the upcoming patch\ndeployment.\n2. Deployment: Apply the security patch to the production environment immediately.\n3. Verification: Perform quick post-deployment checks to ensure the patch was applied successfully\nand the system is stable.\n4. Documentation: Update system logs and security documentation with details of the patch\ndeployment.\nRollback Plan\nIn the unlikely event of a failure, the patch can be removed, and the system will revert to its\npre-patch state. This may extend the downtime by an additional 10 minutes.\nTesting Summary\nDue to the emergency nature of this change, testing was limited to a controlled environment with\nsimulated data. The patch was verified to fix the vulnerability without introducing new issues.\nApproval\nThe change was approved by SClark on 2024-08-15, with immediate implementation following the\nidentification of the critical vulnerability.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders immediately following the deployment.- Post-Implementation Review: A detailed review will be conducted within 48 hours to assess the\neffectiveness of the patch and any impacts on the system."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Change Management Ticket\nChange Request ID: CHG002\nTransport Request: DEVK900002\nRequest Date: 2024-08-15\nApproval Date: 2024-08-18\nTest Date: 2024-08-17\nTest Approval: Yes\nRequester: AJohnson\nTester: AJohnson\nApprover: SClark\nImplementer: AJohnson\nDeveloper: USER002\nApproval Status: Approved\nChange Summary\nTitle: Deployment of Customer Data Integration Module\nType: Normal Change\nPriority: High\nDescription: This change request involves deploying a new customer data integration module to\nenhance the CRM system. The module provides real-time synchronization of customer data across\nall platforms, improving customer service efficiency and accuracy.\nReason for Change\nThe current CRM system lacks real-time data synchronization, leading to inconsistencies and\ndelayed updates. The new module addresses these issues by ensuring that customer data is always\nup-to-date across all platforms.Impact Analysis\nAffected Modules: CRM System\nImpact on Users: Minimal. The new module will run in the background and will not disrupt current\noperations.\nDowntime Required: No\nRisk Assessment: Medium. The module has undergone extensive testing in a staging environment.\nImplementation Plan\n1. Preparation: Verify all dependencies and ensure backups are taken.\n2. Deployment: Transport request DEVK900002 will be moved to the production environment.\n3. Verification: Perform post-deployment testing to confirm all functions are operational.\n4. Documentation: Update system documentation and user guides.\nRollback Plan\nIn case of issues, the transport request will be reversed to restore the system to its previous state\nwithout data loss.\nTesting Summary\nThe module was thoroughly tested by AJohnson on 2024-08-17. All functionalities, including data\naccuracy, performance, and integration, were verified to work as intended.\nApproval\nThe change was approved by SClark on 2024-08-18 following successful testing and impact\nanalysis.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders before deployment.\n- Training: Provide training sessions for users on the new module's features."
                    }
                ],
                "answer": "Pass"
            },
            {
                "Domain": "Segregation of duties",
                "tailored_procedure_design": "The approval for promotion in accordance with agreed upon policies and/or procedures.",
                "design_details": "The approval for promotion of changes at Fountain Plc is in accordance with their Change Management Policy, which was approved in December 2021. The Change Advisory Board (CAB), which consists of senior IT members, is responsible for initiating the approval process. The process owner and the CAB must both sign off before a change is promoted to production. This is to ensure that the version promoted to production is the one that was approved and tested. \n\nThe approval process is tracked and logged within the change tickets in the ServiceNow platform. Each stakeholder records their approval as part of the workflow, and these are reviewed by the CAB before the change is finalized. The CAB, being well-qualified and appropriate for this role, is responsible for enforcing the change management controls. \n\nIn the case of emergency changes, verbal approval from the CAB or CIO is required before deployment. However, formal approval and documentation must be completed within 48 hours of the deployment. \n\nThese controls have been in place since December 2021, when the Change Management Policy was approved. The policy is reviewed annually and updated as necessary to ensure continued relevance and compliance with industry standards. \n\nThe PwC personnel that performed the control during the audit were Emma, a PwC Auditor, and John, the IT Manager at Fountain Plc. The audit was conducted in May 2024.",
                "design_details_from_example": "Based on our audit of Fountain Plc for the year ending 2024-12-31, we have reviewed the company's Change Management Policy and procedures for the approval of promotion of changes in accordance with agreed-upon policies and procedures. \n\nThe Change Management Policy at Fountain Plc clearly outlines the approval process for promoting changes. The Change Advisory Board (CAB), which consists of senior IT members, initiates the approval process. The process owner and the CAB must both sign off before a change is promoted to production. This ensures that the change has been thoroughly reviewed and approved by the appropriate authorities before it is implemented.\n\nIn addition to the approval process, Fountain Plc has a robust testing procedure in place. All changes, regardless of their type, must be tested in a controlled environment before they are deployed. The results of these tests are meticulously documented in the ServiceNow platform. Any issues that arise during testing are logged and addressed before final approval is given. This ensures that only changes that have been thoroughly tested and deemed to be safe and effective are promoted to production.\n\nFurthermore, Fountain Plc has implemented a segregation of duties to ensure that the developer of a change is different from the implementer of the change. This is enforced by assigning different roles for development, testing, and deployment. Developers do not have access to the production environment, and the Change Management Policy mandates that changes must be promoted by someone other than the developer who made the change. This segregation of duties reduces the risk of unauthorized or erroneous changes being implemented.\n\nIn conclusion, Fountain Plc has a well-designed and effectively implemented Change Management Policy that aligns with the key considerations of change approval, testing before deployment, and segregation of duties. The controls have been in place since December 2021 and are enforced by the CAB, which has the appropriate authority to do so.",
                "design_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Walkthrough_Transcript.pdf",
                        "text": "Fountain Plc - Change Management Walkthrough Transcript\nParticipants:\n- Emma (PwC Auditor)\n- John (Fountain Plc IT Manager)\nDate: May 2024\nTranscript\nEmma (PwC Auditor): Can you explain the procedures you have in place for testing, reviewing, and\nauthorizing changes, including emergency changes?\nJohn (Fountain Plc IT Manager): At Fountain Plc, we follow our Change Management Policy and\nStandard Operating Procedures, which were approved by our CIO in December 2021. These\nprocedures outline the entire process for initiating, testing, and approving changes to our IT\nsystems.\nEmma: Who is responsible for making changes to application code or configurations, and how are\nthese changes managed?\nJohn: Changes to application code are handled by our in-house development team. Configuration\nchanges are typically managed by our system administrators. Both types of changes must go\nthrough our standard change management process, which includes logging the change in\nServiceNow, conducting tests, and obtaining approvals from the Change Advisory Board (CAB).\nEmma: How do you define the criteria for emergency changes, and what are the requirements fortesting and approvals in these cases?\nJohn: An emergency change is defined as a change required to prevent or mitigate a critical issue\nthat could disrupt core business operations. For these changes, verbal approval from the CAB or\nCIO is required before deployment. Although the change is implemented immediately, we conduct\ntesting and document the change as soon as possible afterward. Formal approval and\ndocumentation must be completed within 48 hours of the deployment.\nEmma: How do you determine if a change qualifies as an emergency change?\nJohn: The CAB retrospectively reviews the situation to determine whether the emergency criteria\nwere met. Whenever possible, we seek written approval after the deployment.\nEmma: How do you ensure that all changes follow a consistent process, regardless of the type?\nJohn: All changes, whether standard or emergency, are logged and managed through our\nServiceNow platform. We apply the same process across all in-scope applications to ensure\nconsistency in our change management procedures.\nEmma: How do you handle changes to different types of applications, such as hosted applications,\nSaaS solutions, or internally developed systems?\nJohn: Regardless of the application type, whether hosted, SaaS, or internally developed, all\nchanges are categorized as either standard or emergency. They all follow the same change\nmanagement process as outlined in our policy.\nEmma: How do you assess and manage the risks associated with different types of changes?John: Risk assessments are an integral part of our change request process. All changes are logged\nin ServiceNow and are categorized based on their potential impact. The risk level influences the\ndepth of testing required and the level of approval needed.\nEmma: How do you create and validate test cases, scripts, and plans to ensure proper testing?\nJohn: Test cases and scripts are developed by the development team in collaboration with business\nusers. These test cases are executed in a controlled test environment, and the results are\nmeticulously documented. Any issues identified are resolved before the change is promoted to the\nproduction environment.\nEmma: How do you confirm that the appropriate individuals are approving the changes?\nJohn: The required approval levels for each type of change are clearly outlined in our Change\nManagement Policy. Approvals are logged in ServiceNow, and the CAB reviews and signs off on the\nchanges before they are implemented.\nEmma: How do you ensure that all relevant stakeholders have approved the testing cases, scripts,\nand plans?\nJohn: Approvals are tracked and logged within the change tickets in ServiceNow. Each stakeholder\nrecords their approval as part of the workflow, and these are reviewed by the CAB before the\nchange is finalized.\nEmma: How do you document and approve the results of testing procedures?John: The results of all testing procedures are documented in ServiceNow. Any issues that arise\nduring testing are logged and addressed before final approval is given.\nEmma: How do you ensure that the version promoted to production is the one that was approved?\nJohn: We utilize version control software to track changes. The version that is to be promoted is\ncompared against the approved version as part of the change management process.\nEmma: How do you maintain segregated access to development, testing, and production\nenvironments?\nJohn: We ensure segregation by assigning different roles for development, testing, and deployment.\nDevelopers do not have access to the production environment. Our Change Management Policy\nmandates that changes must be promoted by someone other than the developer who made the\nchange.\nEmma: How do you handle the approval for promoting changes to production?\nJohn: The required approval levels are defined in our Change Management Policy. The CAB\ninitiates the approval process, and both the process owner and the CAB must sign off before a\nchange is promoted to production.\nEmma: How long have these controls been in place?\nJohn: These controls have been in place since December 2021, when the Change Management\nPolicy was approved.Emma: Who is responsible for enforcing these controls, and do they have the appropriate authority?\nJohn: The CAB, which consists of senior IT members, is responsible for enforcing the change\nmanagement controls. They are considered well-qualified and appropriate for this role."
                    }
                ],
                "tailored_procedure_implementation": "For one change inspect the approval for promotion in accordance with agreed upon policies and/or procedures.",
                "implementation_details": "In the context of the audit for the client Fountain Plc for the audit year end, we inspected the approval for promotion in accordance with agreed upon policies and procedures for one change. \n\nThe change we inspected was the \"Deployment of Customer Data Integration Module\" (Change Request ID: CHG002). According to the Change Management Policy of Fountain Plc, all changes must be approved by the Change Advisory Board (CAB) or designated approvers. The policy also states that changes must be promoted by someone other than the developer. \n\nIn the case of CHG002, the change was approved by SClark (presumably a member of the CAB or a designated approver) on 2024-08-18. The implementer of the change was AJohnson, who is different from the developer (USER002), adhering to the policy's requirement for segregation of duties. \n\nThe approval status of the change is marked as \"Approved\", indicating that the change was promoted in accordance with the established policies and procedures. \n\nTherefore, based on the information provided, it appears that Fountain Plc has adhered to their Change Management Policy in the approval and promotion of the change CHG002. \n\nThe PwC personnel that performed this control were not specified in the provided context.",
                "implementation_details_from_example": "For the audit period ending on 2024-12-31, we selected the change request under ticket CHG002 for detailed inspection. This change involved the deployment of a new customer data integration module to enhance the CRM system. \n\nThe change was developed by USER002, as per the information provided in the change management ticket. The developer's role is distinct from the implementer, which aligns with the company's segregation of duties policy. The implementer of the change was AJohnson, who was also responsible for testing the change before deployment. \n\nThe testing was conducted on 2024-08-17, and the test approval was marked as 'Yes', indicating that the change had passed the necessary tests before deployment. This aligns with the company's policy that changes must be tested in a controlled environment prior to deployment. \n\nThe approval for the change was granted by SClark on 2024-08-18, after the successful testing and impact analysis. This indicates that the change was approved before deployment, in accordance with the company's policy. \n\nIn conclusion, based on our inspection of the change management ticket CHG002, we found that the approval for promotion of the change was in accordance with the agreed-upon policies and procedures of Fountain Plc. The change was developed, tested, approved, and implemented by different individuals, demonstrating adherence to the segregation of duties policy. The change was also tested and approved before deployment, as required by the company's change management policy.",
                "implementation_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Emergency_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Emergency Change Management Ticket\nChange Request ID: CHG003\nTransport Request: DEVK900003\nRequest Date: 2024-08-15\nApproval Date: 2024-08-15\nTest Date: 2024-08-15\nTest Approval: N/A (Emergency Change)\nRequester: DClark\nTester: DClark\nApprover: SClark\nImplementer: DClark\nDeveloper: USER003\nApproval Status: Approved\nChange Summary\nTitle: Critical Patch Deployment for Security Vulnerability\nType: Emergency Change\nPriority: High\nDescription: This emergency change request involves deploying a critical security patch to address\na newly discovered vulnerability in the customer-facing web application. The patch must be applied\nimmediately to prevent potential exploitation by malicious actors.\nReason for Change\nA critical security vulnerability was identified that could allow unauthorized access to customer data.\nImmediate action is required to deploy the security patch and protect sensitive information.\nImpact AnalysisAffected Modules: Web Application (Customer Portal)\nImpact on Users: Minimal. Users may experience a brief downtime during the patch deployment.\nDowntime Required: Yes, estimated downtime of 15 minutes.\nRisk Assessment: High. While the risk of not deploying the patch is severe, the deployment itself\ncarries minimal risk if done promptly.\nImplementation Plan\n1. Preparation: Notify the IT security team and affected departments of the upcoming patch\ndeployment.\n2. Deployment: Apply the security patch to the production environment immediately.\n3. Verification: Perform quick post-deployment checks to ensure the patch was applied successfully\nand the system is stable.\n4. Documentation: Update system logs and security documentation with details of the patch\ndeployment.\nRollback Plan\nIn the unlikely event of a failure, the patch can be removed, and the system will revert to its\npre-patch state. This may extend the downtime by an additional 10 minutes.\nTesting Summary\nDue to the emergency nature of this change, testing was limited to a controlled environment with\nsimulated data. The patch was verified to fix the vulnerability without introducing new issues.\nApproval\nThe change was approved by SClark on 2024-08-15, with immediate implementation following the\nidentification of the critical vulnerability.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders immediately following the deployment.- Post-Implementation Review: A detailed review will be conducted within 48 hours to assess the\neffectiveness of the patch and any impacts on the system."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Change Management Ticket\nChange Request ID: CHG002\nTransport Request: DEVK900002\nRequest Date: 2024-08-15\nApproval Date: 2024-08-18\nTest Date: 2024-08-17\nTest Approval: Yes\nRequester: AJohnson\nTester: AJohnson\nApprover: SClark\nImplementer: AJohnson\nDeveloper: USER002\nApproval Status: Approved\nChange Summary\nTitle: Deployment of Customer Data Integration Module\nType: Normal Change\nPriority: High\nDescription: This change request involves deploying a new customer data integration module to\nenhance the CRM system. The module provides real-time synchronization of customer data across\nall platforms, improving customer service efficiency and accuracy.\nReason for Change\nThe current CRM system lacks real-time data synchronization, leading to inconsistencies and\ndelayed updates. The new module addresses these issues by ensuring that customer data is always\nup-to-date across all platforms.Impact Analysis\nAffected Modules: CRM System\nImpact on Users: Minimal. The new module will run in the background and will not disrupt current\noperations.\nDowntime Required: No\nRisk Assessment: Medium. The module has undergone extensive testing in a staging environment.\nImplementation Plan\n1. Preparation: Verify all dependencies and ensure backups are taken.\n2. Deployment: Transport request DEVK900002 will be moved to the production environment.\n3. Verification: Perform post-deployment testing to confirm all functions are operational.\n4. Documentation: Update system documentation and user guides.\nRollback Plan\nIn case of issues, the transport request will be reversed to restore the system to its previous state\nwithout data loss.\nTesting Summary\nThe module was thoroughly tested by AJohnson on 2024-08-17. All functionalities, including data\naccuracy, performance, and integration, were verified to work as intended.\nApproval\nThe change was approved by SClark on 2024-08-18 following successful testing and impact\nanalysis.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders before deployment.\n- Training: Provide training sessions for users on the new module's features."
                    }
                ],
                "answer": "Pass"
            }
        ]
    },
    "findings": {
        "overview": "",
        "summary": ""
    }
}