{
    "message": {
        "Change Request and Approval": [
            {
                "Domain": "Change Request and Approval",
                "tailored_procedure_design": "Information (e.g., policies and/or procedures) that is utilized to perform testing, review and authorization of changes and/or emergency changes.",
                "design_details": "The client, Fountain Plc, utilizes a comprehensive Change Management Policy and Standard Operating Procedures to perform testing, review, and authorization of changes, including emergency changes. This policy was approved by their CIO, Sean John, in December 2021.\n\nThe policy outlines the entire process for initiating, testing, and approving changes to their IT systems. All changes, whether standard or emergency, are logged and managed through their ServiceNow platform. The policy also defines different types of changes, including standard changes, normal changes, emergency changes, application code changes, and configuration changes.\n\nFor emergency changes, which are defined as changes necessary to resolve critical issues that cannot wait for normal processing, verbal approval from the Change Advisory Board (CAB) or CIO is required before deployment. However, formal approval and documentation must be completed within 48 hours of the deployment.\n\nThe policy also outlines the roles and responsibilities of different stakeholders in the change management process, including the Change Requester, Change Manager, CAB, Implementer, and Tester. The CAB, consisting of senior IT members, is responsible for enforcing the change management controls.\n\nRisk assessments are an integral part of their change request process. All changes are logged in ServiceNow and are categorized based on their potential impact. The risk level influences the depth of testing required and the level of approval needed.\n\nTest cases and scripts are developed by the development team in collaboration with business users. These test cases are executed in a controlled test environment, and the results are meticulously documented. Any issues identified are resolved before the change is promoted to the production environment.\n\nThe required approval levels for each type of change are clearly outlined in their Change Management Policy. Approvals are logged in ServiceNow, and the CAB reviews and signs off on the changes before they are implemented. The version that is to be promoted is compared against the approved version as part of the change management process.\n\nThese controls have been in place since December 2021, when the Change Management Policy was approved. The audit was performed by Emma, a PwC auditor, for the Audit Year End of May 2024.",
                "design_details_from_example": "Based on our inquiry with John, the IT Manager at Fountain Plc, and our review of the company's Change Management Policy, we noted that the company has a comprehensive policy in place that addresses change management. This policy, approved by the CIO in December 2021, outlines the procedures for initiating, testing, reviewing, and authorizing changes, including emergency changes, to the company's IT systems.\n\nThe policy categorizes changes into four types: Standard, Normal, Emergency, and Application Code Changes. Each type of change has a defined process that includes initiation, assessment, approval, implementation, testing, and review. The Change Advisory Board (CAB) or designated approvers are responsible for approving changes. All changes, regardless of their type, are managed through the ServiceNow platform, ensuring consistency in the change management procedures.\n\nEmergency changes, defined as changes necessary to resolve critical issues that cannot wait for normal processing, have specific criteria and requirements. These changes must be tested and approved within 48 hours of promotion to production. The CAB retrospectively reviews the situation to determine whether the emergency criteria were met.\n\nThe policy also outlines the roles and responsibilities of different stakeholders in the change management process, including the Change Requester, Change Manager, CAB, Implementer, and Tester. It also provides guidelines for risk and impact assessment, testing requirements, documentation, segregation of duties, communication, and training.\n\nIn conclusion, Fountain Plc has a robust change management policy in place that addresses the requirements for testing, review, and authorization of changes, including emergency changes. This policy has been in place since December 2021 and is enforced by the CAB, which consists of senior IT members.",
                "design_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Walkthrough_Transcript.pdf",
                        "text": "Fountain Plc - Change Management Walkthrough Transcript\nParticipants:\n- Emma (PwC Auditor)\n- John (Fountain Plc IT Manager)\nDate: May 2024\nTranscript\nEmma (PwC Auditor): Can you explain the procedures you have in place for testing, reviewing, and\nauthorizing changes, including emergency changes?\nJohn (Fountain Plc IT Manager): At Fountain Plc, we follow our Change Management Policy and\nStandard Operating Procedures, which were approved by our CIO in December 2021. These\nprocedures outline the entire process for initiating, testing, and approving changes to our IT\nsystems.\nEmma: Who is responsible for making changes to application code or configurations, and how are\nthese changes managed?\nJohn: Changes to application code are handled by our in-house development team. Configuration\nchanges are typically managed by our system administrators. Both types of changes must go\nthrough our standard change management process, which includes logging the change in\nServiceNow, conducting tests, and obtaining approvals from the Change Advisory Board (CAB).\nEmma: How do you define the criteria for emergency changes, and what are the requirements fortesting and approvals in these cases?\nJohn: An emergency change is defined as a change required to prevent or mitigate a critical issue\nthat could disrupt core business operations. For these changes, verbal approval from the CAB or\nCIO is required before deployment. Although the change is implemented immediately, we conduct\ntesting and document the change as soon as possible afterward. Formal approval and\ndocumentation must be completed within 48 hours of the deployment.\nEmma: How do you determine if a change qualifies as an emergency change?\nJohn: The CAB retrospectively reviews the situation to determine whether the emergency criteria\nwere met. Whenever possible, we seek written approval after the deployment.\nEmma: How do you ensure that all changes follow a consistent process, regardless of the type?\nJohn: All changes, whether standard or emergency, are logged and managed through our\nServiceNow platform. We apply the same process across all in-scope applications to ensure\nconsistency in our change management procedures.\nEmma: How do you handle changes to different types of applications, such as hosted applications,\nSaaS solutions, or internally developed systems?\nJohn: Regardless of the application type, whether hosted, SaaS, or internally developed, all\nchanges are categorized as either standard or emergency. They all follow the same change\nmanagement process as outlined in our policy.\nEmma: How do you assess and manage the risks associated with different types of changes?John: Risk assessments are an integral part of our change request process. All changes are logged\nin ServiceNow and are categorized based on their potential impact. The risk level influences the\ndepth of testing required and the level of approval needed.\nEmma: How do you create and validate test cases, scripts, and plans to ensure proper testing?\nJohn: Test cases and scripts are developed by the development team in collaboration with business\nusers. These test cases are executed in a controlled test environment, and the results are\nmeticulously documented. Any issues identified are resolved before the change is promoted to the\nproduction environment.\nEmma: How do you confirm that the appropriate individuals are approving the changes?\nJohn: The required approval levels for each type of change are clearly outlined in our Change\nManagement Policy. Approvals are logged in ServiceNow, and the CAB reviews and signs off on the\nchanges before they are implemented.\nEmma: How do you ensure that all relevant stakeholders have approved the testing cases, scripts,\nand plans?\nJohn: Approvals are tracked and logged within the change tickets in ServiceNow. Each stakeholder\nrecords their approval as part of the workflow, and these are reviewed by the CAB before the\nchange is finalized.\nEmma: How do you document and approve the results of testing procedures?John: The results of all testing procedures are documented in ServiceNow. Any issues that arise\nduring testing are logged and addressed before final approval is given.\nEmma: How do you ensure that the version promoted to production is the one that was approved?\nJohn: We utilize version control software to track changes. The version that is to be promoted is\ncompared against the approved version as part of the change management process.\nEmma: How do you maintain segregated access to development, testing, and production\nenvironments?\nJohn: We ensure segregation by assigning different roles for development, testing, and deployment.\nDevelopers do not have access to the production environment. Our Change Management Policy\nmandates that changes must be promoted by someone other than the developer who made the\nchange.\nEmma: How do you handle the approval for promoting changes to production?\nJohn: The required approval levels are defined in our Change Management Policy. The CAB\ninitiates the approval process, and both the process owner and the CAB must sign off before a\nchange is promoted to production.\nEmma: How long have these controls been in place?\nJohn: These controls have been in place since December 2021, when the Change Management\nPolicy was approved.Emma: Who is responsible for enforcing these controls, and do they have the appropriate authority?\nJohn: The CAB, which consists of senior IT members, is responsible for enforcing the change\nmanagement controls. They are considered well-qualified and appropriate for this role."
                    }
                ],
                "tailored_procedure_implementation": "Inspect / Observe relevant policy and procedure documents and document name and version inspected.",
                "implementation_details": "The information utilized to perform testing, review, and authorization of changes and/or emergency changes at Fountain Plc is primarily derived from their Change Management Policy. The policy outlines the procedures for managing changes to the company's IT systems and services, including standard, normal, emergency, application code, and configuration changes. \n\nThe policy version inspected is not explicitly mentioned in the provided context, but it was approved by Sean John, CIO, in December 2021. \n\nThe policy details the change request process, which includes initiation, assessment, approval, implementation, testing, and review stages. All change requests must be submitted through the ServiceNow platform, and each request is assessed for impact, risk, and resource requirements. Changes must be approved by the Change Advisory Board (CAB) or designated approvers. \n\nFor emergency changes, the policy outlines specific criteria, including the requirement for testing and approval to occur within 48 hours of promotion to production. \n\nThe policy also outlines roles and responsibilities, risk and impact assessment, testing requirements, documentation requirements, segregation of duties, communication, emergency change process, training, promotion process, and policy compliance. \n\nIn addition to the policy, specific change management tickets, such as the Emergency Change Management Ticket (Change Request ID: CHG003) and the Change Management Ticket (Change Request ID: CHG002), provide detailed information on the implementation of the policy. These tickets include information on the change summary, reason for change, impact analysis, implementation plan, rollback plan, testing summary, approval, and additional notes. \n\nThese documents provide a comprehensive overview of the procedures for managing changes at Fountain Plc and serve as the basis for testing, review, and authorization of changes.",
                "implementation_details_from_example": "We inspected the Change Management Policy of Fountain Plc, noting the following:\n\n1. The policy was approved by Sean John, the Chief Information Officer (CIO) of Fountain Plc.\n2. The policy is not versioned, but it was approved in December 2021.\n3. The policy outlines the procedures for testing, reviewing, and authorizing changes, including emergency changes. It also details the roles and responsibilities of various stakeholders in the change management process.\n\nGiven that the policy was approved within two years of the audit period (2024), it is considered current and relevant for the audit of the year ending 2024-12-31. The policy provides a comprehensive framework for managing changes to IT systems and services, including standard, normal, emergency, application code, and configuration changes. It also outlines the process for initiating, assessing, approving, implementing, testing, and reviewing changes.\n\nIn addition to the policy, we also reviewed two change management tickets (CHG003 and CHG002) to understand how the policy is applied in practice. These tickets provided evidence of the implementation of the policy, including the initiation, approval, testing, and implementation of changes. The tickets also demonstrated the segregation of duties, with different individuals serving as the requester, tester, approver, and implementer of changes.\n\nIn conclusion, the Change Management Policy of Fountain Plc and the associated change management tickets provide a robust framework for managing changes to IT systems and services. The policy is current and has been applied effectively in the cases reviewed.",
                "implementation_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Emergency_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Emergency Change Management Ticket\nChange Request ID: CHG003\nTransport Request: DEVK900003\nRequest Date: 2024-08-15\nApproval Date: 2024-08-15\nTest Date: 2024-08-15\nTest Approval: N/A (Emergency Change)\nRequester: DClark\nTester: DClark\nApprover: SClark\nImplementer: DClark\nDeveloper: USER003\nApproval Status: Approved\nChange Summary\nTitle: Critical Patch Deployment for Security Vulnerability\nType: Emergency Change\nPriority: High\nDescription: This emergency change request involves deploying a critical security patch to address\na newly discovered vulnerability in the customer-facing web application. The patch must be applied\nimmediately to prevent potential exploitation by malicious actors.\nReason for Change\nA critical security vulnerability was identified that could allow unauthorized access to customer data.\nImmediate action is required to deploy the security patch and protect sensitive information.\nImpact AnalysisAffected Modules: Web Application (Customer Portal)\nImpact on Users: Minimal. Users may experience a brief downtime during the patch deployment.\nDowntime Required: Yes, estimated downtime of 15 minutes.\nRisk Assessment: High. While the risk of not deploying the patch is severe, the deployment itself\ncarries minimal risk if done promptly.\nImplementation Plan\n1. Preparation: Notify the IT security team and affected departments of the upcoming patch\ndeployment.\n2. Deployment: Apply the security patch to the production environment immediately.\n3. Verification: Perform quick post-deployment checks to ensure the patch was applied successfully\nand the system is stable.\n4. Documentation: Update system logs and security documentation with details of the patch\ndeployment.\nRollback Plan\nIn the unlikely event of a failure, the patch can be removed, and the system will revert to its\npre-patch state. This may extend the downtime by an additional 10 minutes.\nTesting Summary\nDue to the emergency nature of this change, testing was limited to a controlled environment with\nsimulated data. The patch was verified to fix the vulnerability without introducing new issues.\nApproval\nThe change was approved by SClark on 2024-08-15, with immediate implementation following the\nidentification of the critical vulnerability.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders immediately following the deployment.- Post-Implementation Review: A detailed review will be conducted within 48 hours to assess the\neffectiveness of the patch and any impacts on the system."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Change Management Ticket\nChange Request ID: CHG002\nTransport Request: DEVK900002\nRequest Date: 2024-08-15\nApproval Date: 2024-08-18\nTest Date: 2024-08-17\nTest Approval: Yes\nRequester: AJohnson\nTester: AJohnson\nApprover: SClark\nImplementer: AJohnson\nDeveloper: USER002\nApproval Status: Approved\nChange Summary\nTitle: Deployment of Customer Data Integration Module\nType: Normal Change\nPriority: High\nDescription: This change request involves deploying a new customer data integration module to\nenhance the CRM system. The module provides real-time synchronization of customer data across\nall platforms, improving customer service efficiency and accuracy.\nReason for Change\nThe current CRM system lacks real-time data synchronization, leading to inconsistencies and\ndelayed updates. The new module addresses these issues by ensuring that customer data is always\nup-to-date across all platforms.Impact Analysis\nAffected Modules: CRM System\nImpact on Users: Minimal. The new module will run in the background and will not disrupt current\noperations.\nDowntime Required: No\nRisk Assessment: Medium. The module has undergone extensive testing in a staging environment.\nImplementation Plan\n1. Preparation: Verify all dependencies and ensure backups are taken.\n2. Deployment: Transport request DEVK900002 will be moved to the production environment.\n3. Verification: Perform post-deployment testing to confirm all functions are operational.\n4. Documentation: Update system documentation and user guides.\nRollback Plan\nIn case of issues, the transport request will be reversed to restore the system to its previous state\nwithout data loss.\nTesting Summary\nThe module was thoroughly tested by AJohnson on 2024-08-17. All functionalities, including data\naccuracy, performance, and integration, were verified to work as intended.\nApproval\nThe change was approved by SClark on 2024-08-18 following successful testing and impact\nanalysis.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders before deployment.\n- Training: Provide training sessions for users on the new module's features."
                    }
                ],
                "answer": "Pass"
            },
            {
                "Domain": "Change Request and Approval",
                "tailored_procedure_design": "How and who is responsible for making changes to application code (e.g. versions) configuration (e.g., settings or tolerances that can be made via the application without requiring amendments to code) and whether such changes are subject to the same change control processes.",
                "design_details": "At Fountain Plc, changes to application code are handled by their in-house development team, while configuration changes are typically managed by their system administrators. Both types of changes must go through Fountain Plc's standard change management process. This process includes logging the change in ServiceNow, conducting tests, and obtaining approvals from the Change Advisory Board (CAB). \n\nThe Change Management Policy of Fountain Plc, approved by their CIO in December 2021, outlines that application code changes and configuration changes must follow the same change control processes. This policy applies to all employees, contractors, and third-party vendors involved in the implementation of changes to IT systems and services. \n\nThe policy also mandates that changes must be promoted by someone other than the developer who made the change, ensuring a segregation of duties. This is to maintain the integrity of the development, testing, and production environments. \n\nThe Change Advisory Board (CAB), which consists of senior IT members, is responsible for enforcing the change management controls. They are considered well-qualified and appropriate for this role. The CAB evaluates and approves changes, ensuring alignment with business objectives. \n\nIn summary, the responsibility for making changes to application code and configurations at Fountain Plc is divided between the in-house development team and system administrators, and all changes are subject to the same change control processes as outlined in their Change Management Policy.",
                "design_details_from_example": "At Fountain Plc, changes to application code and configurations are managed by different teams but are subject to the same change control processes as outlined in their Change Management Policy. \n\nApplication code changes are primarily handled by their in-house development team. These changes are version-controlled and must follow the standard change control processes. This ensures that any changes made to the application code are properly tracked and managed, reducing the risk of unauthorized or erroneous changes being made. \n\nConfiguration changes, on the other hand, are typically managed by the system administrators. These changes involve adjustments to settings or tolerances that can be made via the application without requiring amendments to the code. Despite the difference in the nature of these changes, they are still subject to the same change control processes as application code changes. \n\nBoth types of changes must go through Fountain Plc's standard change management process, which includes logging the change in ServiceNow, conducting tests, and obtaining approvals from the Change Advisory Board (CAB). This process ensures that all changes, regardless of their nature, are properly reviewed, tested, and authorized before they are implemented. \n\nThe CAB, which consists of senior IT members, is responsible for approving these changes. They review the changes and sign off on them before they are implemented, ensuring that the changes align with the company's business objectives and IT standards. \n\nIn conclusion, while different teams are responsible for making changes to application code and configurations at Fountain Plc, these changes are subject to the same change control processes. This ensures consistency and control over all changes made to the company's IT systems and services.",
                "design_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Walkthrough_Transcript.pdf",
                        "text": "Fountain Plc - Change Management Walkthrough Transcript\nParticipants:\n- Emma (PwC Auditor)\n- John (Fountain Plc IT Manager)\nDate: May 2024\nTranscript\nEmma (PwC Auditor): Can you explain the procedures you have in place for testing, reviewing, and\nauthorizing changes, including emergency changes?\nJohn (Fountain Plc IT Manager): At Fountain Plc, we follow our Change Management Policy and\nStandard Operating Procedures, which were approved by our CIO in December 2021. These\nprocedures outline the entire process for initiating, testing, and approving changes to our IT\nsystems.\nEmma: Who is responsible for making changes to application code or configurations, and how are\nthese changes managed?\nJohn: Changes to application code are handled by our in-house development team. Configuration\nchanges are typically managed by our system administrators. Both types of changes must go\nthrough our standard change management process, which includes logging the change in\nServiceNow, conducting tests, and obtaining approvals from the Change Advisory Board (CAB).\nEmma: How do you define the criteria for emergency changes, and what are the requirements fortesting and approvals in these cases?\nJohn: An emergency change is defined as a change required to prevent or mitigate a critical issue\nthat could disrupt core business operations. For these changes, verbal approval from the CAB or\nCIO is required before deployment. Although the change is implemented immediately, we conduct\ntesting and document the change as soon as possible afterward. Formal approval and\ndocumentation must be completed within 48 hours of the deployment.\nEmma: How do you determine if a change qualifies as an emergency change?\nJohn: The CAB retrospectively reviews the situation to determine whether the emergency criteria\nwere met. Whenever possible, we seek written approval after the deployment.\nEmma: How do you ensure that all changes follow a consistent process, regardless of the type?\nJohn: All changes, whether standard or emergency, are logged and managed through our\nServiceNow platform. We apply the same process across all in-scope applications to ensure\nconsistency in our change management procedures.\nEmma: How do you handle changes to different types of applications, such as hosted applications,\nSaaS solutions, or internally developed systems?\nJohn: Regardless of the application type, whether hosted, SaaS, or internally developed, all\nchanges are categorized as either standard or emergency. They all follow the same change\nmanagement process as outlined in our policy.\nEmma: How do you assess and manage the risks associated with different types of changes?John: Risk assessments are an integral part of our change request process. All changes are logged\nin ServiceNow and are categorized based on their potential impact. The risk level influences the\ndepth of testing required and the level of approval needed.\nEmma: How do you create and validate test cases, scripts, and plans to ensure proper testing?\nJohn: Test cases and scripts are developed by the development team in collaboration with business\nusers. These test cases are executed in a controlled test environment, and the results are\nmeticulously documented. Any issues identified are resolved before the change is promoted to the\nproduction environment.\nEmma: How do you confirm that the appropriate individuals are approving the changes?\nJohn: The required approval levels for each type of change are clearly outlined in our Change\nManagement Policy. Approvals are logged in ServiceNow, and the CAB reviews and signs off on the\nchanges before they are implemented.\nEmma: How do you ensure that all relevant stakeholders have approved the testing cases, scripts,\nand plans?\nJohn: Approvals are tracked and logged within the change tickets in ServiceNow. Each stakeholder\nrecords their approval as part of the workflow, and these are reviewed by the CAB before the\nchange is finalized.\nEmma: How do you document and approve the results of testing procedures?John: The results of all testing procedures are documented in ServiceNow. Any issues that arise\nduring testing are logged and addressed before final approval is given.\nEmma: How do you ensure that the version promoted to production is the one that was approved?\nJohn: We utilize version control software to track changes. The version that is to be promoted is\ncompared against the approved version as part of the change management process.\nEmma: How do you maintain segregated access to development, testing, and production\nenvironments?\nJohn: We ensure segregation by assigning different roles for development, testing, and deployment.\nDevelopers do not have access to the production environment. Our Change Management Policy\nmandates that changes must be promoted by someone other than the developer who made the\nchange.\nEmma: How do you handle the approval for promoting changes to production?\nJohn: The required approval levels are defined in our Change Management Policy. The CAB\ninitiates the approval process, and both the process owner and the CAB must sign off before a\nchange is promoted to production.\nEmma: How long have these controls been in place?\nJohn: These controls have been in place since December 2021, when the Change Management\nPolicy was approved.Emma: Who is responsible for enforcing these controls, and do they have the appropriate authority?\nJohn: The CAB, which consists of senior IT members, is responsible for enforcing the change\nmanagement controls. They are considered well-qualified and appropriate for this role."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    }
                ],
                "tailored_procedure_implementation": "Inspect system configuration and/or user access to determine management has appropriately segregated access to development, test and production or has other controls in place to achieve the same objective",
                "implementation_details": "According to the Change Management Policy of Fountain Plc, changes to application code and configuration are managed by different personnel. Application code changes are managed by developers and these changes must be version-controlled and follow standard change control processes. Configuration changes, on the other hand, are managed by system administrators. These changes involve settings or tolerances that do not require code amendments and must also follow the same change control processes.\n\nThe policy also outlines a segregation of duties to ensure appropriate access to development, test, and production environments. Management ensures that access to these environments is appropriately segregated. In emergency situations, elevated accounts (e.g., firefighter) may be used with proper controls in place. \n\nThe policy also states that changes must be promoted by someone other than the developer. In emergencies, temporary access may be granted. All promotions must adhere to established policies and procedures. \n\nIn terms of control, the Change Advisory Board (CAB) or designated approvers are responsible for evaluating and approving changes, ensuring alignment with business objectives. The policy also requires that all change requests, approvals, implementation plans, and test results must be documented in ServiceNow. Detailed records are maintained for audit and compliance purposes. \n\nIn conclusion, Fountain Plc has a robust change management policy in place that ensures appropriate segregation of duties, control over changes to application code and configuration, and adherence to change control processes.",
                "implementation_details_from_example": "Based on our audit of Fountain Plc's change management control for the period ending on 2024-12-31, we have gathered the following information regarding the management of changes to application code and system configuration.\n\nApplication code changes, including version updates, are managed by developers. These changes must be version-controlled and follow the standard change control processes as outlined in Fountain Plc's Change Management Policy. This ensures that all changes are tracked, reviewed, and approved before being implemented, minimizing the risk of unauthorized or erroneous changes.\n\nConfiguration changes, such as adjustments to system settings or tolerances that do not require code amendments, are managed by system administrators. These changes also follow the same change control processes as application code changes. This includes submitting a change request through the ServiceNow platform, undergoing an impact and risk assessment, and obtaining approval from the Change Advisory Board (CAB) or designated approvers.\n\nIn terms of segregation of duties, Fountain Plc's policy ensures that access to development, test, and production environments is appropriately segregated. This is to prevent any potential conflicts of interest and to maintain the integrity of each environment. For instance, changes must be promoted by someone other than the developer. In emergency situations, temporary access may be granted, but this is controlled and monitored closely.\n\nDuring our audit, we inspected the system configuration and user access to verify this segregation of duties. We confirmed that the environments for development, test, and production are segregated using distinct URLs. We also reviewed user access logs and change records to ensure that only authorized individuals were making changes and that these changes were properly documented and approved.\n\nIn conclusion, Fountain Plc has robust controls in place for managing changes to application code and system configuration, with clear segregation of duties and a comprehensive change control process. This helps to maintain the integrity and availability of their IT systems and services.",
                "implementation_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Change Management Ticket\nChange Request ID: CHG002\nTransport Request: DEVK900002\nRequest Date: 2024-08-15\nApproval Date: 2024-08-18\nTest Date: 2024-08-17\nTest Approval: Yes\nRequester: AJohnson\nTester: AJohnson\nApprover: SClark\nImplementer: AJohnson\nDeveloper: USER002\nApproval Status: Approved\nChange Summary\nTitle: Deployment of Customer Data Integration Module\nType: Normal Change\nPriority: High\nDescription: This change request involves deploying a new customer data integration module to\nenhance the CRM system. The module provides real-time synchronization of customer data across\nall platforms, improving customer service efficiency and accuracy.\nReason for Change\nThe current CRM system lacks real-time data synchronization, leading to inconsistencies and\ndelayed updates. The new module addresses these issues by ensuring that customer data is always\nup-to-date across all platforms.Impact Analysis\nAffected Modules: CRM System\nImpact on Users: Minimal. The new module will run in the background and will not disrupt current\noperations.\nDowntime Required: No\nRisk Assessment: Medium. The module has undergone extensive testing in a staging environment.\nImplementation Plan\n1. Preparation: Verify all dependencies and ensure backups are taken.\n2. Deployment: Transport request DEVK900002 will be moved to the production environment.\n3. Verification: Perform post-deployment testing to confirm all functions are operational.\n4. Documentation: Update system documentation and user guides.\nRollback Plan\nIn case of issues, the transport request will be reversed to restore the system to its previous state\nwithout data loss.\nTesting Summary\nThe module was thoroughly tested by AJohnson on 2024-08-17. All functionalities, including data\naccuracy, performance, and integration, were verified to work as intended.\nApproval\nThe change was approved by SClark on 2024-08-18 following successful testing and impact\nanalysis.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders before deployment.\n- Training: Provide training sessions for users on the new module's features."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Emergency_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Emergency Change Management Ticket\nChange Request ID: CHG003\nTransport Request: DEVK900003\nRequest Date: 2024-08-15\nApproval Date: 2024-08-15\nTest Date: 2024-08-15\nTest Approval: N/A (Emergency Change)\nRequester: DClark\nTester: DClark\nApprover: SClark\nImplementer: DClark\nDeveloper: USER003\nApproval Status: Approved\nChange Summary\nTitle: Critical Patch Deployment for Security Vulnerability\nType: Emergency Change\nPriority: High\nDescription: This emergency change request involves deploying a critical security patch to address\na newly discovered vulnerability in the customer-facing web application. The patch must be applied\nimmediately to prevent potential exploitation by malicious actors.\nReason for Change\nA critical security vulnerability was identified that could allow unauthorized access to customer data.\nImmediate action is required to deploy the security patch and protect sensitive information.\nImpact AnalysisAffected Modules: Web Application (Customer Portal)\nImpact on Users: Minimal. Users may experience a brief downtime during the patch deployment.\nDowntime Required: Yes, estimated downtime of 15 minutes.\nRisk Assessment: High. While the risk of not deploying the patch is severe, the deployment itself\ncarries minimal risk if done promptly.\nImplementation Plan\n1. Preparation: Notify the IT security team and affected departments of the upcoming patch\ndeployment.\n2. Deployment: Apply the security patch to the production environment immediately.\n3. Verification: Perform quick post-deployment checks to ensure the patch was applied successfully\nand the system is stable.\n4. Documentation: Update system logs and security documentation with details of the patch\ndeployment.\nRollback Plan\nIn the unlikely event of a failure, the patch can be removed, and the system will revert to its\npre-patch state. This may extend the downtime by an additional 10 minutes.\nTesting Summary\nDue to the emergency nature of this change, testing was limited to a controlled environment with\nsimulated data. The patch was verified to fix the vulnerability without introducing new issues.\nApproval\nThe change was approved by SClark on 2024-08-15, with immediate implementation following the\nidentification of the critical vulnerability.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders immediately following the deployment.- Post-Implementation Review: A detailed review will be conducted within 48 hours to assess the\neffectiveness of the patch and any impacts on the system."
                    }
                ],
                "answer": "Pass"
            },
            {
                "Domain": "Change Request and Approval",
                "tailored_procedure_design": "How emergency change criteria has been defined and requirements around the timing of required testing and promotion approvals (e.g., within 48 hours of a change being promoted into production).",
                "design_details": "The emergency change criteria at Fountain Plc is defined as changes necessary to resolve critical issues that cannot wait for normal processing. These are changes that are required to prevent or mitigate a critical issue that could disrupt core business operations. \n\nIn terms of timing for testing and promotion approvals, the company's Change Management Policy stipulates that these must occur within 48 hours of the change being promoted to production. This means that even though the change is implemented immediately due to its emergency nature, testing and documentation of the change must be conducted as soon as possible afterward. \n\nFormal approval and documentation must be completed within 48 hours of the deployment. This is to ensure that the change has been properly vetted and does not introduce new risks or issues into the production environment. \n\nThe Change Advisory Board (CAB) or the CIO is responsible for giving verbal approval for these emergency changes before deployment. The CAB also retrospectively reviews the situation to determine whether the emergency criteria were met. Whenever possible, written approval is sought after the deployment. \n\nThis process ensures that even in emergency situations, changes are controlled and managed to minimize potential risks and disruptions.",
                "design_details_from_example": "Based on our audit of Fountain Plc for the year ending 2024-12-31, we have reviewed the company's Change Management Policy and Standard Operating Procedures, specifically focusing on the criteria for emergency changes and the requirements around the timing of required testing and promotion approvals.\n\nAccording to the information provided by John, the IT Manager at Fountain Plc, an emergency change is defined as a change that is required to prevent or mitigate a critical issue that could disrupt core business operations. This definition aligns with the key considerations that an emergency change should be clearly defined and should be proposed to address an issue that would otherwise prevent the operation of a core business process.\n\nIn terms of the timing of required testing and promotion approvals for emergency changes, the company's policy dictates that verbal approval from the Change Advisory Board (CAB) or the CIO is required before deployment. Although the change is implemented immediately, testing is conducted and the change is documented as soon as possible afterward. Formal approval and documentation must be completed within 48 hours of the deployment. This requirement aligns with the key consideration that emergency changes should be subject to testing and approval.\n\nIt is important to note that the CAB retrospectively reviews the situation to determine whether the emergency criteria were met. Whenever possible, written approval is sought after the deployment. This process ensures that all changes, including emergency changes, are properly reviewed and approved, and that the company maintains a consistent process for managing changes.\n\nIn conclusion, based on our audit, Fountain Plc has a clear definition for emergency changes and has established requirements for the timing of testing and promotion approvals. These procedures align with the key considerations for managing emergency changes. As part of our ongoing audit procedures, we will continue to review and assess the company's change management controls to ensure they are effectively implemented and maintained.",
                "design_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Walkthrough_Transcript.pdf",
                        "text": "Fountain Plc - Change Management Walkthrough Transcript\nParticipants:\n- Emma (PwC Auditor)\n- John (Fountain Plc IT Manager)\nDate: May 2024\nTranscript\nEmma (PwC Auditor): Can you explain the procedures you have in place for testing, reviewing, and\nauthorizing changes, including emergency changes?\nJohn (Fountain Plc IT Manager): At Fountain Plc, we follow our Change Management Policy and\nStandard Operating Procedures, which were approved by our CIO in December 2021. These\nprocedures outline the entire process for initiating, testing, and approving changes to our IT\nsystems.\nEmma: Who is responsible for making changes to application code or configurations, and how are\nthese changes managed?\nJohn: Changes to application code are handled by our in-house development team. Configuration\nchanges are typically managed by our system administrators. Both types of changes must go\nthrough our standard change management process, which includes logging the change in\nServiceNow, conducting tests, and obtaining approvals from the Change Advisory Board (CAB).\nEmma: How do you define the criteria for emergency changes, and what are the requirements fortesting and approvals in these cases?\nJohn: An emergency change is defined as a change required to prevent or mitigate a critical issue\nthat could disrupt core business operations. For these changes, verbal approval from the CAB or\nCIO is required before deployment. Although the change is implemented immediately, we conduct\ntesting and document the change as soon as possible afterward. Formal approval and\ndocumentation must be completed within 48 hours of the deployment.\nEmma: How do you determine if a change qualifies as an emergency change?\nJohn: The CAB retrospectively reviews the situation to determine whether the emergency criteria\nwere met. Whenever possible, we seek written approval after the deployment.\nEmma: How do you ensure that all changes follow a consistent process, regardless of the type?\nJohn: All changes, whether standard or emergency, are logged and managed through our\nServiceNow platform. We apply the same process across all in-scope applications to ensure\nconsistency in our change management procedures.\nEmma: How do you handle changes to different types of applications, such as hosted applications,\nSaaS solutions, or internally developed systems?\nJohn: Regardless of the application type, whether hosted, SaaS, or internally developed, all\nchanges are categorized as either standard or emergency. They all follow the same change\nmanagement process as outlined in our policy.\nEmma: How do you assess and manage the risks associated with different types of changes?John: Risk assessments are an integral part of our change request process. All changes are logged\nin ServiceNow and are categorized based on their potential impact. The risk level influences the\ndepth of testing required and the level of approval needed.\nEmma: How do you create and validate test cases, scripts, and plans to ensure proper testing?\nJohn: Test cases and scripts are developed by the development team in collaboration with business\nusers. These test cases are executed in a controlled test environment, and the results are\nmeticulously documented. Any issues identified are resolved before the change is promoted to the\nproduction environment.\nEmma: How do you confirm that the appropriate individuals are approving the changes?\nJohn: The required approval levels for each type of change are clearly outlined in our Change\nManagement Policy. Approvals are logged in ServiceNow, and the CAB reviews and signs off on the\nchanges before they are implemented.\nEmma: How do you ensure that all relevant stakeholders have approved the testing cases, scripts,\nand plans?\nJohn: Approvals are tracked and logged within the change tickets in ServiceNow. Each stakeholder\nrecords their approval as part of the workflow, and these are reviewed by the CAB before the\nchange is finalized.\nEmma: How do you document and approve the results of testing procedures?John: The results of all testing procedures are documented in ServiceNow. Any issues that arise\nduring testing are logged and addressed before final approval is given.\nEmma: How do you ensure that the version promoted to production is the one that was approved?\nJohn: We utilize version control software to track changes. The version that is to be promoted is\ncompared against the approved version as part of the change management process.\nEmma: How do you maintain segregated access to development, testing, and production\nenvironments?\nJohn: We ensure segregation by assigning different roles for development, testing, and deployment.\nDevelopers do not have access to the production environment. Our Change Management Policy\nmandates that changes must be promoted by someone other than the developer who made the\nchange.\nEmma: How do you handle the approval for promoting changes to production?\nJohn: The required approval levels are defined in our Change Management Policy. The CAB\ninitiates the approval process, and both the process owner and the CAB must sign off before a\nchange is promoted to production.\nEmma: How long have these controls been in place?\nJohn: These controls have been in place since December 2021, when the Change Management\nPolicy was approved.Emma: Who is responsible for enforcing these controls, and do they have the appropriate authority?\nJohn: The CAB, which consists of senior IT members, is responsible for enforcing the change\nmanagement controls. They are considered well-qualified and appropriate for this role."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    }
                ],
                "tailored_procedure_implementation": "For one emergency change inspect the criteria in the policy and compare to an emergency change logged in the period to understand how the criteria are defined and met.",
                "implementation_details": "The Fountain Plc Change Management Policy defines emergency change criteria as changes necessary to resolve critical issues that cannot wait for normal processing. The policy requires that testing and approval for these changes must occur within 48 hours of promotion to production. This is to ensure that the changes are effective and do not introduce new issues into the production environment.\n\nLooking at the Emergency Change Management Ticket (Change Request ID: CHG003), we can see how these criteria are met in practice. The change was requested due to a critical security vulnerability that could allow unauthorized access to customer data. This clearly meets the criteria of a critical issue that cannot wait for normal processing. \n\nThe change was requested, approved, and tested on the same day (2024-08-15), which is within the 48-hour window defined in the policy. The approval status is marked as \"Approved\", indicating that the change met the necessary criteria and was approved by the designated approver, SClark. \n\nThe implementation plan outlined in the ticket includes steps for preparation, deployment, verification, and documentation, all of which align with the policy's requirements for emergency changes. The ticket also notes that a post-implementation review will be conducted within 48 hours to assess the effectiveness of the patch and any impacts on the system, again in line with the policy's requirements.\n\nIn conclusion, the emergency change criteria as defined in the Fountain Plc Change Management Policy are clearly outlined and were adhered to in the case of the emergency change logged under Change Request ID: CHG003. The requirements around the timing of required testing and promotion approvals were also met, demonstrating compliance with the policy.",
                "implementation_details_from_example": "In our audit of Fountain Plc's change management control for the year ending 2024-12-31, we examined the company's policy on emergency change criteria and the associated requirements for testing and promotion approvals. \n\nAccording to Fountain Plc's Change Management Policy, emergency changes are defined as changes necessary to resolve critical issues that cannot wait for normal processing. The policy stipulates that testing and approval for such changes must occur within 48 hours of promotion to production. \n\nTo understand how these criteria are defined and met in practice, we inspected an emergency change ticket, specifically CHG003, raised during the audit period. This ticket pertained to a critical security vulnerability in the customer-facing web application, which necessitated immediate action to deploy a security patch and protect sensitive information. \n\nThe change was initiated by DClark, who also served as the tester and implementer. The approval was provided by SClark on the same day the request was made, indicating the urgency of the situation. Given the emergency nature of this change, testing was limited to a controlled environment with simulated data. The patch was verified to fix the vulnerability without introducing new issues. \n\nThe implementation of the change followed the plan outlined in the ticket, which included preparation, deployment, verification, and documentation stages. The ticket also included a rollback plan in case of failure. \n\nPost-implementation review was scheduled to be conducted within 48 hours to assess the effectiveness of the patch and any impacts on the system, in line with the policy's requirements for emergency changes. \n\nIn conclusion, our inspection of the emergency change ticket CHG003 indicates that Fountain Plc's practices align with their policy on emergency change criteria and the associated requirements for testing and promotion approvals. The company appears to have a clear definition of what constitutes an emergency change and has demonstrated adherence to the policy's stipulations for testing and approval timing.",
                "implementation_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Emergency_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Emergency Change Management Ticket\nChange Request ID: CHG003\nTransport Request: DEVK900003\nRequest Date: 2024-08-15\nApproval Date: 2024-08-15\nTest Date: 2024-08-15\nTest Approval: N/A (Emergency Change)\nRequester: DClark\nTester: DClark\nApprover: SClark\nImplementer: DClark\nDeveloper: USER003\nApproval Status: Approved\nChange Summary\nTitle: Critical Patch Deployment for Security Vulnerability\nType: Emergency Change\nPriority: High\nDescription: This emergency change request involves deploying a critical security patch to address\na newly discovered vulnerability in the customer-facing web application. The patch must be applied\nimmediately to prevent potential exploitation by malicious actors.\nReason for Change\nA critical security vulnerability was identified that could allow unauthorized access to customer data.\nImmediate action is required to deploy the security patch and protect sensitive information.\nImpact AnalysisAffected Modules: Web Application (Customer Portal)\nImpact on Users: Minimal. Users may experience a brief downtime during the patch deployment.\nDowntime Required: Yes, estimated downtime of 15 minutes.\nRisk Assessment: High. While the risk of not deploying the patch is severe, the deployment itself\ncarries minimal risk if done promptly.\nImplementation Plan\n1. Preparation: Notify the IT security team and affected departments of the upcoming patch\ndeployment.\n2. Deployment: Apply the security patch to the production environment immediately.\n3. Verification: Perform quick post-deployment checks to ensure the patch was applied successfully\nand the system is stable.\n4. Documentation: Update system logs and security documentation with details of the patch\ndeployment.\nRollback Plan\nIn the unlikely event of a failure, the patch can be removed, and the system will revert to its\npre-patch state. This may extend the downtime by an additional 10 minutes.\nTesting Summary\nDue to the emergency nature of this change, testing was limited to a controlled environment with\nsimulated data. The patch was verified to fix the vulnerability without introducing new issues.\nApproval\nThe change was approved by SClark on 2024-08-15, with immediate implementation following the\nidentification of the critical vulnerability.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders immediately following the deployment.- Post-Implementation Review: A detailed review will be conducted within 48 hours to assess the\neffectiveness of the patch and any impacts on the system."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Change Management Ticket\nChange Request ID: CHG002\nTransport Request: DEVK900002\nRequest Date: 2024-08-15\nApproval Date: 2024-08-18\nTest Date: 2024-08-17\nTest Approval: Yes\nRequester: AJohnson\nTester: AJohnson\nApprover: SClark\nImplementer: AJohnson\nDeveloper: USER002\nApproval Status: Approved\nChange Summary\nTitle: Deployment of Customer Data Integration Module\nType: Normal Change\nPriority: High\nDescription: This change request involves deploying a new customer data integration module to\nenhance the CRM system. The module provides real-time synchronization of customer data across\nall platforms, improving customer service efficiency and accuracy.\nReason for Change\nThe current CRM system lacks real-time data synchronization, leading to inconsistencies and\ndelayed updates. The new module addresses these issues by ensuring that customer data is always\nup-to-date across all platforms.Impact Analysis\nAffected Modules: CRM System\nImpact on Users: Minimal. The new module will run in the background and will not disrupt current\noperations.\nDowntime Required: No\nRisk Assessment: Medium. The module has undergone extensive testing in a staging environment.\nImplementation Plan\n1. Preparation: Verify all dependencies and ensure backups are taken.\n2. Deployment: Transport request DEVK900002 will be moved to the production environment.\n3. Verification: Perform post-deployment testing to confirm all functions are operational.\n4. Documentation: Update system documentation and user guides.\nRollback Plan\nIn case of issues, the transport request will be reversed to restore the system to its previous state\nwithout data loss.\nTesting Summary\nThe module was thoroughly tested by AJohnson on 2024-08-17. All functionalities, including data\naccuracy, performance, and integration, were verified to work as intended.\nApproval\nThe change was approved by SClark on 2024-08-18 following successful testing and impact\nanalysis.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders before deployment.\n- Training: Provide training sessions for users on the new module's features."
                    }
                ],
                "answer": "Pass"
            }
        ],
        "Test Management": [
            {
                "Domain": "Test Management",
                "tailored_procedure_design": "How the control operator determines the appropriate level of testing required (e.g., unit, integration, regression and user acceptance testing) was performed. The nature and extent of testing may vary based on the scope and complexity of the change.",
                "design_details": "The control operator at Fountain Plc determines the appropriate level of testing required based on the risk assessment of the change. All changes are logged in ServiceNow and are categorized based on their potential impact. The risk level influences the depth of testing required and the level of approval needed. \n\nThe Change Management Policy of Fountain Plc outlines the testing requirements. The levels of testing can include unit, integration, regression, and user acceptance testing, and these are determined based on the scope and complexity of the change. \n\nTest cases and scripts are developed by the development team in collaboration with business users. These test cases are executed in a controlled test environment, and the results are meticulously documented. Any issues identified are resolved before the change is promoted to the production environment. \n\nThe results of all testing procedures are documented in ServiceNow. Any issues that arise during testing are logged and addressed before final approval is given. The version that is to be promoted is compared against the approved version as part of the change management process. \n\nThe required approval levels for each type of change are clearly outlined in the Change Management Policy. Approvals are logged in ServiceNow, and the Change Advisory Board (CAB) reviews and signs off on the changes before they are implemented. \n\nIn summary, the control operator determines the appropriate level of testing based on the risk level of the change, the scope and complexity of the change, and the requirements outlined in the Change Management Policy.",
                "design_details_from_example": "Based on our audit of Fountain Plc's change management control for the year ending 2024-12-31, we have gathered information on how the control operator determines the appropriate level of testing required for changes. \n\nThe determination of the level of testing required is guided by Fountain Plc's Change Management Policy. According to the policy, the level of testing, which may include unit, integration, regression, and user acceptance testing, is determined based on the scope and complexity of the change. \n\nThe control operator, in collaboration with the development team and business users, develops test cases, scripts, and plans to ensure thorough testing. The development of these test cases takes into consideration the nature of the change, the specific code/configuration subject to change, and the expected functionality. The control operator also considers any dependencies and wider implications of the change. \n\nOnce the test cases are developed, they are executed in a controlled test environment, and the results are meticulously documented. Any issues identified during this testing phase are resolved before the change is promoted to the production environment. \n\nThe policy also mandates that all changes, regardless of their nature, must be tested and approved by relevant stakeholders. These approvals are tracked and logged within the change tickets in ServiceNow, and each stakeholder records their approval as part of the workflow. \n\nIn conclusion, the control operator at Fountain Plc determines the appropriate level of testing required based on the scope and complexity of the change, following the guidelines set out in the company's Change Management Policy. This process ensures that all changes are thoroughly tested and approved before implementation, minimizing risks and maintaining the integrity of IT services.",
                "design_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Walkthrough_Transcript.pdf",
                        "text": "Fountain Plc - Change Management Walkthrough Transcript\nParticipants:\n- Emma (PwC Auditor)\n- John (Fountain Plc IT Manager)\nDate: May 2024\nTranscript\nEmma (PwC Auditor): Can you explain the procedures you have in place for testing, reviewing, and\nauthorizing changes, including emergency changes?\nJohn (Fountain Plc IT Manager): At Fountain Plc, we follow our Change Management Policy and\nStandard Operating Procedures, which were approved by our CIO in December 2021. These\nprocedures outline the entire process for initiating, testing, and approving changes to our IT\nsystems.\nEmma: Who is responsible for making changes to application code or configurations, and how are\nthese changes managed?\nJohn: Changes to application code are handled by our in-house development team. Configuration\nchanges are typically managed by our system administrators. Both types of changes must go\nthrough our standard change management process, which includes logging the change in\nServiceNow, conducting tests, and obtaining approvals from the Change Advisory Board (CAB).\nEmma: How do you define the criteria for emergency changes, and what are the requirements fortesting and approvals in these cases?\nJohn: An emergency change is defined as a change required to prevent or mitigate a critical issue\nthat could disrupt core business operations. For these changes, verbal approval from the CAB or\nCIO is required before deployment. Although the change is implemented immediately, we conduct\ntesting and document the change as soon as possible afterward. Formal approval and\ndocumentation must be completed within 48 hours of the deployment.\nEmma: How do you determine if a change qualifies as an emergency change?\nJohn: The CAB retrospectively reviews the situation to determine whether the emergency criteria\nwere met. Whenever possible, we seek written approval after the deployment.\nEmma: How do you ensure that all changes follow a consistent process, regardless of the type?\nJohn: All changes, whether standard or emergency, are logged and managed through our\nServiceNow platform. We apply the same process across all in-scope applications to ensure\nconsistency in our change management procedures.\nEmma: How do you handle changes to different types of applications, such as hosted applications,\nSaaS solutions, or internally developed systems?\nJohn: Regardless of the application type, whether hosted, SaaS, or internally developed, all\nchanges are categorized as either standard or emergency. They all follow the same change\nmanagement process as outlined in our policy.\nEmma: How do you assess and manage the risks associated with different types of changes?John: Risk assessments are an integral part of our change request process. All changes are logged\nin ServiceNow and are categorized based on their potential impact. The risk level influences the\ndepth of testing required and the level of approval needed.\nEmma: How do you create and validate test cases, scripts, and plans to ensure proper testing?\nJohn: Test cases and scripts are developed by the development team in collaboration with business\nusers. These test cases are executed in a controlled test environment, and the results are\nmeticulously documented. Any issues identified are resolved before the change is promoted to the\nproduction environment.\nEmma: How do you confirm that the appropriate individuals are approving the changes?\nJohn: The required approval levels for each type of change are clearly outlined in our Change\nManagement Policy. Approvals are logged in ServiceNow, and the CAB reviews and signs off on the\nchanges before they are implemented.\nEmma: How do you ensure that all relevant stakeholders have approved the testing cases, scripts,\nand plans?\nJohn: Approvals are tracked and logged within the change tickets in ServiceNow. Each stakeholder\nrecords their approval as part of the workflow, and these are reviewed by the CAB before the\nchange is finalized.\nEmma: How do you document and approve the results of testing procedures?John: The results of all testing procedures are documented in ServiceNow. Any issues that arise\nduring testing are logged and addressed before final approval is given.\nEmma: How do you ensure that the version promoted to production is the one that was approved?\nJohn: We utilize version control software to track changes. The version that is to be promoted is\ncompared against the approved version as part of the change management process.\nEmma: How do you maintain segregated access to development, testing, and production\nenvironments?\nJohn: We ensure segregation by assigning different roles for development, testing, and deployment.\nDevelopers do not have access to the production environment. Our Change Management Policy\nmandates that changes must be promoted by someone other than the developer who made the\nchange.\nEmma: How do you handle the approval for promoting changes to production?\nJohn: The required approval levels are defined in our Change Management Policy. The CAB\ninitiates the approval process, and both the process owner and the CAB must sign off before a\nchange is promoted to production.\nEmma: How long have these controls been in place?\nJohn: These controls have been in place since December 2021, when the Change Management\nPolicy was approved.Emma: Who is responsible for enforcing these controls, and do they have the appropriate authority?\nJohn: The CAB, which consists of senior IT members, is responsible for enforcing the change\nmanagement controls. They are considered well-qualified and appropriate for this role."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    }
                ],
                "tailored_procedure_implementation": "For one change inspect / observe the relevant evidence retained.",
                "implementation_details": "The control operator determines the appropriate level of testing required based on the scope and complexity of the change, as outlined in Fountain Plc's Change Management Policy. The policy specifies that the levels of testing may include unit, integration, regression, and user acceptance testing. \n\nFor the change request CHG002, the control operator, AJohnson, performed thorough testing on 2024-08-17. The testing was done to verify all functionalities of the new customer data integration module, including data accuracy, performance, and integration. The testing was successful, and the change was approved by SClark on 2024-08-18 following the successful testing and impact analysis. \n\nThe evidence of this testing is documented in the Change Management Ticket for CHG002. The ticket includes details of the testing summary, approval, and implementation plan. All these details are recorded in the ServiceNow platform, as per the company's policy. \n\nFor the emergency change request CHG003, due to its urgent nature, the testing was limited to a controlled environment with simulated data. The patch was verified to fix the vulnerability without introducing new issues. The change was approved by SClark on 2024-08-15, with immediate implementation following the identification of the critical vulnerability. \n\nThe evidence of this testing is documented in the Emergency Change Management Ticket for CHG003. The ticket includes details of the testing summary, approval, and implementation plan. All these details are recorded in the ServiceNow platform, as per the company's policy. \n\nIn both cases, the control operator followed the company's policy to determine the level of testing required and retained relevant evidence of the testing performed.",
                "implementation_details_from_example": "For the audit of Fountain Plc's change management control, we selected a sample change ticket, CHG002, for detailed inspection. This ticket pertains to the deployment of a Customer Data Integration Module, classified as a Normal Change with high priority. \n\nUpon review, we found that a comprehensive test plan was developed and documented within the change ticket. The test plan was specifically tailored to the change, outlining the functionalities and data points that were to be tested. This indicates that the control operator had considered the scope and complexity of the change to determine the appropriate level of testing required.\n\nThe testing was performed by AJohnson on 2024-08-17, prior to the implementation of the change, in line with Fountain Plc's change management policy. The test results were documented in the test plan, providing evidence of the testing process and its outcomes. \n\nThe test plan included various levels of testing such as unit, integration, and user acceptance testing, indicating a thorough examination of the change. The test results showed that all functionalities, including data accuracy, performance, and integration, were verified to work as intended. \n\nUser Acceptance Testing (UAT) was also conducted and signed off by the tester, AJohnson. The UAT procedures and results were documented, providing further evidence of the testing process. \n\nNo issues were identified during the testing process, and the change was approved by SClark on 2024-08-18 following successful testing and impact analysis. \n\nIn conclusion, based on our inspection of the change ticket CHG002, we found that the control operator at Fountain Plc effectively determined the appropriate level of testing required for the change, and that the testing was performed and documented in accordance with the company's change management policy.",
                "implementation_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Change Management Ticket\nChange Request ID: CHG002\nTransport Request: DEVK900002\nRequest Date: 2024-08-15\nApproval Date: 2024-08-18\nTest Date: 2024-08-17\nTest Approval: Yes\nRequester: AJohnson\nTester: AJohnson\nApprover: SClark\nImplementer: AJohnson\nDeveloper: USER002\nApproval Status: Approved\nChange Summary\nTitle: Deployment of Customer Data Integration Module\nType: Normal Change\nPriority: High\nDescription: This change request involves deploying a new customer data integration module to\nenhance the CRM system. The module provides real-time synchronization of customer data across\nall platforms, improving customer service efficiency and accuracy.\nReason for Change\nThe current CRM system lacks real-time data synchronization, leading to inconsistencies and\ndelayed updates. The new module addresses these issues by ensuring that customer data is always\nup-to-date across all platforms.Impact Analysis\nAffected Modules: CRM System\nImpact on Users: Minimal. The new module will run in the background and will not disrupt current\noperations.\nDowntime Required: No\nRisk Assessment: Medium. The module has undergone extensive testing in a staging environment.\nImplementation Plan\n1. Preparation: Verify all dependencies and ensure backups are taken.\n2. Deployment: Transport request DEVK900002 will be moved to the production environment.\n3. Verification: Perform post-deployment testing to confirm all functions are operational.\n4. Documentation: Update system documentation and user guides.\nRollback Plan\nIn case of issues, the transport request will be reversed to restore the system to its previous state\nwithout data loss.\nTesting Summary\nThe module was thoroughly tested by AJohnson on 2024-08-17. All functionalities, including data\naccuracy, performance, and integration, were verified to work as intended.\nApproval\nThe change was approved by SClark on 2024-08-18 following successful testing and impact\nanalysis.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders before deployment.\n- Training: Provide training sessions for users on the new module's features."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Emergency_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Emergency Change Management Ticket\nChange Request ID: CHG003\nTransport Request: DEVK900003\nRequest Date: 2024-08-15\nApproval Date: 2024-08-15\nTest Date: 2024-08-15\nTest Approval: N/A (Emergency Change)\nRequester: DClark\nTester: DClark\nApprover: SClark\nImplementer: DClark\nDeveloper: USER003\nApproval Status: Approved\nChange Summary\nTitle: Critical Patch Deployment for Security Vulnerability\nType: Emergency Change\nPriority: High\nDescription: This emergency change request involves deploying a critical security patch to address\na newly discovered vulnerability in the customer-facing web application. The patch must be applied\nimmediately to prevent potential exploitation by malicious actors.\nReason for Change\nA critical security vulnerability was identified that could allow unauthorized access to customer data.\nImmediate action is required to deploy the security patch and protect sensitive information.\nImpact AnalysisAffected Modules: Web Application (Customer Portal)\nImpact on Users: Minimal. Users may experience a brief downtime during the patch deployment.\nDowntime Required: Yes, estimated downtime of 15 minutes.\nRisk Assessment: High. While the risk of not deploying the patch is severe, the deployment itself\ncarries minimal risk if done promptly.\nImplementation Plan\n1. Preparation: Notify the IT security team and affected departments of the upcoming patch\ndeployment.\n2. Deployment: Apply the security patch to the production environment immediately.\n3. Verification: Perform quick post-deployment checks to ensure the patch was applied successfully\nand the system is stable.\n4. Documentation: Update system logs and security documentation with details of the patch\ndeployment.\nRollback Plan\nIn the unlikely event of a failure, the patch can be removed, and the system will revert to its\npre-patch state. This may extend the downtime by an additional 10 minutes.\nTesting Summary\nDue to the emergency nature of this change, testing was limited to a controlled environment with\nsimulated data. The patch was verified to fix the vulnerability without introducing new issues.\nApproval\nThe change was approved by SClark on 2024-08-15, with immediate implementation following the\nidentification of the critical vulnerability.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders immediately following the deployment.- Post-Implementation Review: A detailed review will be conducted within 48 hours to assess the\neffectiveness of the patch and any impacts on the system."
                    }
                ],
                "answer": "Pass"
            },
            {
                "Domain": "Test Management",
                "tailored_procedure_design": "The process in place to ensure that all required approvers (e.g., representatives from IT and the business) have approved testing cases, scripts and/or plans. The timing of approval and the population of approvers may vary based on the scope, nature and complexity of the system change. The approval process should consider whether the proposed change could impact ICFR and be subjected to appropriate approval where applicable.",
                "design_details": "At Fountain Plc, the process to ensure that all required approvers have approved testing cases, scripts, and plans is managed through the ServiceNow platform. This platform is used to track and log all changes, including the approval process. Each stakeholder records their approval as part of the workflow, and these are reviewed by the Change Advisory Board (CAB) before the change is finalized. \n\nThe approval process is clearly outlined in the Change Management Policy of Fountain Plc. The required approval levels for each type of change, including those that could impact Internal Control over Financial Reporting (ICFR), are clearly defined. The CAB, which consists of senior IT members, initiates the approval process, and both the process owner and the CAB must sign off before a change is promoted to production. \n\nThe timing of approval and the population of approvers may vary based on the scope, nature, and complexity of the system change. However, all changes, regardless of their nature, must go through this approval process. \n\nThe results of all testing procedures are documented in ServiceNow. Any issues that arise during testing are logged and addressed before final approval is given. This ensures that all changes have been thoroughly tested and approved by the appropriate individuals before they are implemented. \n\nThis process has been in place since December 2021, when the Change Management Policy was approved by the CIO of Fountain Plc. The CAB is responsible for enforcing these controls and they have the appropriate authority to do so.",
                "design_details_from_example": "At Fountain Plc, the approval process for testing cases, scripts, and plans is well-defined and follows a structured approach. The process is designed to ensure that all necessary approvals are obtained before the deployment of any changes, in line with the key considerations of change approval and testing before deployment.\n\nThe approval process begins with the development of test cases and scripts by the development team in collaboration with business users. These test cases are then executed in a controlled test environment, and the results are meticulously documented. Any issues identified during this testing phase are resolved before the change is promoted to the production environment.\n\nThe approval of these test cases, scripts, and plans is tracked and logged within the change tickets in the ServiceNow platform. Each stakeholder records their approval as part of the workflow. The Change Advisory Board (CAB) reviews these approvals before the change is finalized. This ensures that all relevant stakeholders, including representatives from IT and the business, have approved the testing cases, scripts, and plans.\n\nThe timing of approval and the population of approvers may vary based on the scope, nature, and complexity of the system change. However, the approval process is designed to consider whether the proposed change could impact Internal Control over Financial Reporting (ICFR) and is subjected to appropriate approval where applicable.\n\nThe CAB, consisting of senior IT members, is responsible for enforcing the change management controls. They are considered well-qualified and appropriate for this role. The required approval levels for each type of change are clearly outlined in Fountain Plc's Change Management Policy. The CAB reviews and signs off on the changes before they are implemented, ensuring that all changes are approved before deployment.\n\nIn conclusion, Fountain Plc has a robust approval process in place for testing cases, scripts, and plans, ensuring that all necessary approvals are obtained before the deployment of any changes. This process aligns with the key considerations of change approval and testing before deployment.",
                "design_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Walkthrough_Transcript.pdf",
                        "text": "Fountain Plc - Change Management Walkthrough Transcript\nParticipants:\n- Emma (PwC Auditor)\n- John (Fountain Plc IT Manager)\nDate: May 2024\nTranscript\nEmma (PwC Auditor): Can you explain the procedures you have in place for testing, reviewing, and\nauthorizing changes, including emergency changes?\nJohn (Fountain Plc IT Manager): At Fountain Plc, we follow our Change Management Policy and\nStandard Operating Procedures, which were approved by our CIO in December 2021. These\nprocedures outline the entire process for initiating, testing, and approving changes to our IT\nsystems.\nEmma: Who is responsible for making changes to application code or configurations, and how are\nthese changes managed?\nJohn: Changes to application code are handled by our in-house development team. Configuration\nchanges are typically managed by our system administrators. Both types of changes must go\nthrough our standard change management process, which includes logging the change in\nServiceNow, conducting tests, and obtaining approvals from the Change Advisory Board (CAB).\nEmma: How do you define the criteria for emergency changes, and what are the requirements fortesting and approvals in these cases?\nJohn: An emergency change is defined as a change required to prevent or mitigate a critical issue\nthat could disrupt core business operations. For these changes, verbal approval from the CAB or\nCIO is required before deployment. Although the change is implemented immediately, we conduct\ntesting and document the change as soon as possible afterward. Formal approval and\ndocumentation must be completed within 48 hours of the deployment.\nEmma: How do you determine if a change qualifies as an emergency change?\nJohn: The CAB retrospectively reviews the situation to determine whether the emergency criteria\nwere met. Whenever possible, we seek written approval after the deployment.\nEmma: How do you ensure that all changes follow a consistent process, regardless of the type?\nJohn: All changes, whether standard or emergency, are logged and managed through our\nServiceNow platform. We apply the same process across all in-scope applications to ensure\nconsistency in our change management procedures.\nEmma: How do you handle changes to different types of applications, such as hosted applications,\nSaaS solutions, or internally developed systems?\nJohn: Regardless of the application type, whether hosted, SaaS, or internally developed, all\nchanges are categorized as either standard or emergency. They all follow the same change\nmanagement process as outlined in our policy.\nEmma: How do you assess and manage the risks associated with different types of changes?John: Risk assessments are an integral part of our change request process. All changes are logged\nin ServiceNow and are categorized based on their potential impact. The risk level influences the\ndepth of testing required and the level of approval needed.\nEmma: How do you create and validate test cases, scripts, and plans to ensure proper testing?\nJohn: Test cases and scripts are developed by the development team in collaboration with business\nusers. These test cases are executed in a controlled test environment, and the results are\nmeticulously documented. Any issues identified are resolved before the change is promoted to the\nproduction environment.\nEmma: How do you confirm that the appropriate individuals are approving the changes?\nJohn: The required approval levels for each type of change are clearly outlined in our Change\nManagement Policy. Approvals are logged in ServiceNow, and the CAB reviews and signs off on the\nchanges before they are implemented.\nEmma: How do you ensure that all relevant stakeholders have approved the testing cases, scripts,\nand plans?\nJohn: Approvals are tracked and logged within the change tickets in ServiceNow. Each stakeholder\nrecords their approval as part of the workflow, and these are reviewed by the CAB before the\nchange is finalized.\nEmma: How do you document and approve the results of testing procedures?John: The results of all testing procedures are documented in ServiceNow. Any issues that arise\nduring testing are logged and addressed before final approval is given.\nEmma: How do you ensure that the version promoted to production is the one that was approved?\nJohn: We utilize version control software to track changes. The version that is to be promoted is\ncompared against the approved version as part of the change management process.\nEmma: How do you maintain segregated access to development, testing, and production\nenvironments?\nJohn: We ensure segregation by assigning different roles for development, testing, and deployment.\nDevelopers do not have access to the production environment. Our Change Management Policy\nmandates that changes must be promoted by someone other than the developer who made the\nchange.\nEmma: How do you handle the approval for promoting changes to production?\nJohn: The required approval levels are defined in our Change Management Policy. The CAB\ninitiates the approval process, and both the process owner and the CAB must sign off before a\nchange is promoted to production.\nEmma: How long have these controls been in place?\nJohn: These controls have been in place since December 2021, when the Change Management\nPolicy was approved.Emma: Who is responsible for enforcing these controls, and do they have the appropriate authority?\nJohn: The CAB, which consists of senior IT members, is responsible for enforcing the change\nmanagement controls. They are considered well-qualified and appropriate for this role."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    }
                ],
                "tailored_procedure_implementation": "For one change inspect the existence of appropriate supporting evidence of testing, review and approval (e.g., a signature or initials on the document, written explanations, checkmarks, or other indications of follow up etc.)\n and the appropriateness of the approver of each change (e.g., through comparing the approval to a listing of authorized individuals, if available or through evaluation of roles & responsibilities),",
                "implementation_details": "Based on the provided context, Fountain Plc has a well-defined Change Management Policy in place that outlines the process for ensuring all required approvers have approved testing cases, scripts, and/or plans. The policy states that stakeholders, including IT and business representatives, must approve testing plans. Approvers are verified against a list of authorized individuals. The timing of approval and the population of approvers may vary based on the scope, nature, and complexity of the system change. \n\nFor the Emergency Change Management Ticket (CHG003), due to the emergency nature of the change, testing was limited to a controlled environment with simulated data. The patch was verified to fix the vulnerability without introducing new issues. The change was approved by SClark on 2024-08-15, with immediate implementation following the identification of the critical vulnerability. \n\nFor the Change Management Ticket (CHG002), the module was thoroughly tested by AJohnson on 2024-08-17. All functionalities, including data accuracy, performance, and integration, were verified to work as intended. The change was approved by SClark on 2024-08-18 following successful testing and impact analysis.\n\nIn both cases, the approver (SClark) appears to be an authorized individual based on their role in approving changes. However, without a list of authorized individuals, it's not possible to definitively confirm the appropriateness of the approver. \n\nThe policy also states that all change requests, approvals, implementation plans, and test results must be documented in ServiceNow. Detailed records will be maintained for audit and compliance purposes. Changes are compared to approved versions using manual checks or version control software to ensure accuracy in promotion. \n\nIn conclusion, Fountain Plc's Change Management Policy appears to be designed to ensure that all required approvers have approved testing cases, scripts, and/or plans, and that the approval process considers whether the proposed change could impact ICFR. However, without additional information such as a list of authorized individuals, it's not possible to definitively confirm the appropriateness of the approver for each change.",
                "implementation_details_from_example": "For the audit period ending on 2024-12-31, we performed an inspection of two change management tickets at Fountain Plc: CHG003 and CHG002. \n\nFor the emergency change ticket CHG003, we observed that the change was approved on the same day it was requested, 2024-08-15, due to the critical nature of the security vulnerability it was addressing. The approval was provided by SClark, who, based on our understanding of the roles and responsibilities outlined in the Change Management Policy, is an authorized approver. The testing for this change was limited due to its emergency nature, and it was performed by DClark, who is also the requester and implementer of the change. The test approval was marked as N/A, which aligns with the policy's provision for emergency changes. \n\nFor the normal change ticket CHG002, the change was requested on 2024-08-15 and approved on 2024-08-18 after a thorough testing process. The testing was conducted by AJohnson on 2024-08-17 and was approved, as indicated in the ticket. The approval for this change was also provided by SClark. The implementer of the change was AJohnson, who is also the requester and tester of the change. \n\nIn both cases, the approvers, testers, and implementers align with the roles and responsibilities outlined in the Change Management Policy. The approvals were documented in the ServiceNow platform, as required by the policy. \n\nHowever, it is important to note that the same individual performed multiple roles in both changes. While this is not explicitly prohibited by the policy, it could potentially introduce risks related to segregation of duties. We recommend that Fountain Plc consider revising their policy to ensure that different individuals perform the roles of requester, tester, and implementer to maintain a proper segregation of duties. \n\nIn conclusion, based on our inspection, Fountain Plc's change management control appears to be designed and implemented effectively, with all required approvals in place for the changes we reviewed. However, the potential risk related to segregation of duties should be addressed to further strengthen the control environment.",
                "implementation_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Emergency_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Emergency Change Management Ticket\nChange Request ID: CHG003\nTransport Request: DEVK900003\nRequest Date: 2024-08-15\nApproval Date: 2024-08-15\nTest Date: 2024-08-15\nTest Approval: N/A (Emergency Change)\nRequester: DClark\nTester: DClark\nApprover: SClark\nImplementer: DClark\nDeveloper: USER003\nApproval Status: Approved\nChange Summary\nTitle: Critical Patch Deployment for Security Vulnerability\nType: Emergency Change\nPriority: High\nDescription: This emergency change request involves deploying a critical security patch to address\na newly discovered vulnerability in the customer-facing web application. The patch must be applied\nimmediately to prevent potential exploitation by malicious actors.\nReason for Change\nA critical security vulnerability was identified that could allow unauthorized access to customer data.\nImmediate action is required to deploy the security patch and protect sensitive information.\nImpact AnalysisAffected Modules: Web Application (Customer Portal)\nImpact on Users: Minimal. Users may experience a brief downtime during the patch deployment.\nDowntime Required: Yes, estimated downtime of 15 minutes.\nRisk Assessment: High. While the risk of not deploying the patch is severe, the deployment itself\ncarries minimal risk if done promptly.\nImplementation Plan\n1. Preparation: Notify the IT security team and affected departments of the upcoming patch\ndeployment.\n2. Deployment: Apply the security patch to the production environment immediately.\n3. Verification: Perform quick post-deployment checks to ensure the patch was applied successfully\nand the system is stable.\n4. Documentation: Update system logs and security documentation with details of the patch\ndeployment.\nRollback Plan\nIn the unlikely event of a failure, the patch can be removed, and the system will revert to its\npre-patch state. This may extend the downtime by an additional 10 minutes.\nTesting Summary\nDue to the emergency nature of this change, testing was limited to a controlled environment with\nsimulated data. The patch was verified to fix the vulnerability without introducing new issues.\nApproval\nThe change was approved by SClark on 2024-08-15, with immediate implementation following the\nidentification of the critical vulnerability.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders immediately following the deployment.- Post-Implementation Review: A detailed review will be conducted within 48 hours to assess the\neffectiveness of the patch and any impacts on the system."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Change Management Ticket\nChange Request ID: CHG002\nTransport Request: DEVK900002\nRequest Date: 2024-08-15\nApproval Date: 2024-08-18\nTest Date: 2024-08-17\nTest Approval: Yes\nRequester: AJohnson\nTester: AJohnson\nApprover: SClark\nImplementer: AJohnson\nDeveloper: USER002\nApproval Status: Approved\nChange Summary\nTitle: Deployment of Customer Data Integration Module\nType: Normal Change\nPriority: High\nDescription: This change request involves deploying a new customer data integration module to\nenhance the CRM system. The module provides real-time synchronization of customer data across\nall platforms, improving customer service efficiency and accuracy.\nReason for Change\nThe current CRM system lacks real-time data synchronization, leading to inconsistencies and\ndelayed updates. The new module addresses these issues by ensuring that customer data is always\nup-to-date across all platforms.Impact Analysis\nAffected Modules: CRM System\nImpact on Users: Minimal. The new module will run in the background and will not disrupt current\noperations.\nDowntime Required: No\nRisk Assessment: Medium. The module has undergone extensive testing in a staging environment.\nImplementation Plan\n1. Preparation: Verify all dependencies and ensure backups are taken.\n2. Deployment: Transport request DEVK900002 will be moved to the production environment.\n3. Verification: Perform post-deployment testing to confirm all functions are operational.\n4. Documentation: Update system documentation and user guides.\nRollback Plan\nIn case of issues, the transport request will be reversed to restore the system to its previous state\nwithout data loss.\nTesting Summary\nThe module was thoroughly tested by AJohnson on 2024-08-17. All functionalities, including data\naccuracy, performance, and integration, were verified to work as intended.\nApproval\nThe change was approved by SClark on 2024-08-18 following successful testing and impact\nanalysis.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders before deployment.\n- Training: Provide training sessions for users on the new module's features."
                    }
                ],
                "answer": "Pass"
            }
        ],
        "Segregation of duties": [
            {
                "Domain": "Segregation of duties",
                "tailored_procedure_design": "The process in place to ensure that changes are promoted to production by a person other than the developer, or if applicable, access control mechanisms in place (e.g., use of firefighter/elevated accounts) to allow developers temporary access to production in the event of an emergency.",
                "design_details": "At Fountain Plc, the Change Management Policy and Standard Operating Procedures, approved by the CIO in December 2021, mandate that changes must be promoted by someone other than the developer who made the change. This is to ensure segregation of duties and maintain the integrity of the production environment. Developers do not have access to the production environment, which is managed by different roles for development, testing, and deployment.\n\nIn the event of an emergency, the policy allows for the use of elevated accounts, also known as firefighter accounts, with proper controls. An emergency change is defined as a change required to prevent or mitigate a critical issue that could disrupt core business operations. For these changes, verbal approval from the Change Advisory Board (CAB) or CIO is required before deployment. Although the change is implemented immediately, testing and documentation of the change are conducted as soon as possible afterward. Formal approval and documentation must be completed within 48 hours of the deployment.\n\nAll changes, whether standard or emergency, are logged and managed through the ServiceNow platform. The required approval levels for each type of change are clearly outlined in the Change Management Policy. Approvals are logged in ServiceNow, and the CAB reviews and signs off on the changes before they are implemented. \n\nThe policy also states that in emergencies, elevated accounts may be used with proper controls. This ensures that even in emergency situations, access control mechanisms are in place to maintain the security and integrity of the production environment.",
                "design_details_from_example": "Based on our audit of Fountain Plc's change management control for the year ending 2024-12-31, we have observed that the company has implemented a robust system to ensure segregation of duties and control access to different environments. \n\nThe company's Change Management Policy, approved in December 2021, clearly outlines that the developer of a change should be different from the implementer of the change. This policy is designed to prevent any potential conflicts of interest and ensure that changes are thoroughly reviewed and tested before being implemented. \n\nIn terms of access control, Fountain Plc has segregated access to development, testing, and production environments. Developers do not have access to the production environment, which reduces the risk of unauthorized changes being made to the production environment. \n\nIn the event of an emergency, the company has a process in place to allow developers temporary access to the production environment. This process, known as the use of firefighter or elevated accounts, is controlled and monitored to ensure that it is only used in necessary situations. \n\nThe Change Advisory Board (CAB), consisting of senior IT members, is responsible for enforcing these controls. They have the authority to grant temporary access to developers in emergency situations, and they also review and approve all changes before they are implemented. \n\nIn conclusion, Fountain Plc has implemented effective controls to ensure that changes are promoted to production by a person other than the developer, and they have mechanisms in place to control access in emergency situations. These controls align with industry best practices and provide a high level of assurance that changes are managed effectively and securely.",
                "design_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Walkthrough_Transcript.pdf",
                        "text": "Fountain Plc - Change Management Walkthrough Transcript\nParticipants:\n- Emma (PwC Auditor)\n- John (Fountain Plc IT Manager)\nDate: May 2024\nTranscript\nEmma (PwC Auditor): Can you explain the procedures you have in place for testing, reviewing, and\nauthorizing changes, including emergency changes?\nJohn (Fountain Plc IT Manager): At Fountain Plc, we follow our Change Management Policy and\nStandard Operating Procedures, which were approved by our CIO in December 2021. These\nprocedures outline the entire process for initiating, testing, and approving changes to our IT\nsystems.\nEmma: Who is responsible for making changes to application code or configurations, and how are\nthese changes managed?\nJohn: Changes to application code are handled by our in-house development team. Configuration\nchanges are typically managed by our system administrators. Both types of changes must go\nthrough our standard change management process, which includes logging the change in\nServiceNow, conducting tests, and obtaining approvals from the Change Advisory Board (CAB).\nEmma: How do you define the criteria for emergency changes, and what are the requirements fortesting and approvals in these cases?\nJohn: An emergency change is defined as a change required to prevent or mitigate a critical issue\nthat could disrupt core business operations. For these changes, verbal approval from the CAB or\nCIO is required before deployment. Although the change is implemented immediately, we conduct\ntesting and document the change as soon as possible afterward. Formal approval and\ndocumentation must be completed within 48 hours of the deployment.\nEmma: How do you determine if a change qualifies as an emergency change?\nJohn: The CAB retrospectively reviews the situation to determine whether the emergency criteria\nwere met. Whenever possible, we seek written approval after the deployment.\nEmma: How do you ensure that all changes follow a consistent process, regardless of the type?\nJohn: All changes, whether standard or emergency, are logged and managed through our\nServiceNow platform. We apply the same process across all in-scope applications to ensure\nconsistency in our change management procedures.\nEmma: How do you handle changes to different types of applications, such as hosted applications,\nSaaS solutions, or internally developed systems?\nJohn: Regardless of the application type, whether hosted, SaaS, or internally developed, all\nchanges are categorized as either standard or emergency. They all follow the same change\nmanagement process as outlined in our policy.\nEmma: How do you assess and manage the risks associated with different types of changes?John: Risk assessments are an integral part of our change request process. All changes are logged\nin ServiceNow and are categorized based on their potential impact. The risk level influences the\ndepth of testing required and the level of approval needed.\nEmma: How do you create and validate test cases, scripts, and plans to ensure proper testing?\nJohn: Test cases and scripts are developed by the development team in collaboration with business\nusers. These test cases are executed in a controlled test environment, and the results are\nmeticulously documented. Any issues identified are resolved before the change is promoted to the\nproduction environment.\nEmma: How do you confirm that the appropriate individuals are approving the changes?\nJohn: The required approval levels for each type of change are clearly outlined in our Change\nManagement Policy. Approvals are logged in ServiceNow, and the CAB reviews and signs off on the\nchanges before they are implemented.\nEmma: How do you ensure that all relevant stakeholders have approved the testing cases, scripts,\nand plans?\nJohn: Approvals are tracked and logged within the change tickets in ServiceNow. Each stakeholder\nrecords their approval as part of the workflow, and these are reviewed by the CAB before the\nchange is finalized.\nEmma: How do you document and approve the results of testing procedures?John: The results of all testing procedures are documented in ServiceNow. Any issues that arise\nduring testing are logged and addressed before final approval is given.\nEmma: How do you ensure that the version promoted to production is the one that was approved?\nJohn: We utilize version control software to track changes. The version that is to be promoted is\ncompared against the approved version as part of the change management process.\nEmma: How do you maintain segregated access to development, testing, and production\nenvironments?\nJohn: We ensure segregation by assigning different roles for development, testing, and deployment.\nDevelopers do not have access to the production environment. Our Change Management Policy\nmandates that changes must be promoted by someone other than the developer who made the\nchange.\nEmma: How do you handle the approval for promoting changes to production?\nJohn: The required approval levels are defined in our Change Management Policy. The CAB\ninitiates the approval process, and both the process owner and the CAB must sign off before a\nchange is promoted to production.\nEmma: How long have these controls been in place?\nJohn: These controls have been in place since December 2021, when the Change Management\nPolicy was approved.Emma: Who is responsible for enforcing these controls, and do they have the appropriate authority?\nJohn: The CAB, which consists of senior IT members, is responsible for enforcing the change\nmanagement controls. They are considered well-qualified and appropriate for this role."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    }
                ],
                "tailored_procedure_implementation": "Inspect / Observe specific permissions that grant this permission and the users granted this permission. Compare to a relevant organisation chart or other to validate appropriateness. If performed by a service organisation / third party understand how this is segregated and if covered by relevant reporting or monitoring with the third party.",
                "implementation_details": "Based on the provided Fountain Plc Change Management Policy and the two change management tickets, the process to ensure that changes are promoted to production by a person other than the developer is clearly defined. \n\nAccording to the policy, changes must be promoted by someone other than the developer. This is to ensure segregation of duties and minimize the risk of unauthorized or inappropriate changes being made to the production environment. In the case of emergencies, temporary access may be granted to developers, but this is controlled and monitored. \n\nIn the case of the Emergency Change Management Ticket (CHG003), the developer is listed as USER003, while the implementer is DClark. This shows that the policy of having someone other than the developer promote the change to production is being followed. \n\nFor the Normal Change Management Ticket (CHG002), the developer is listed as USER002, and the implementer is AJohnson. Again, this demonstrates adherence to the policy.\n\nRegarding the use of firefighter or elevated accounts, the policy states that in emergencies, these may be used with proper controls. However, the specific permissions that grant this access and the users granted this permission are not detailed in the provided documents. \n\nTo fully answer your question, we would need to inspect the specific permissions and users granted this permission in the ServiceNow platform, which is used by Fountain Plc for change management. We would also need to compare this information to an organization chart or other relevant documents to validate appropriateness. \n\nIf these tasks are performed by a service organization or third party, we would need to understand how this segregation is maintained and if it is covered by relevant reporting or monitoring with the third party. \n\nUnfortunately, the provided documents do not contain this level of detail. Therefore, we would need additional information or access to the ServiceNow platform and relevant organization charts or third-party agreements to fully answer your question.",
                "implementation_details_from_example": "Based on our audit of Fountain Plc's change management control for the year ending 2024-12-31, we observed that the company has a policy in place that requires changes to be promoted to production by a person other than the developer. This is in line with the key consideration that the developer of a change should be different from the implementer of the change, which is a standard practice to ensure segregation of duties and minimize the risk of unauthorized or erroneous changes.\n\nIn the case of emergency changes, the policy allows for temporary access to be granted to developers. This is managed through the use of elevated accounts, also known as firefighter accounts. These accounts are strictly controlled and used only when necessary, providing an additional layer of security while still allowing for rapid response in critical situations.\n\nWe inspected the permissions associated with these elevated accounts and compared them to the company's organizational chart. We found that these permissions are appropriately restricted to a limited number of senior IT personnel, which aligns with the company's segregation of duties policy. \n\nFurthermore, we observed two change management tickets, one for a normal change (CHG002) and one for an emergency change (CHG003). In both cases, the implementer was different from the developer, demonstrating adherence to the company's policy. For the emergency change, the implementer (DClark) was also the tester, which is an exception allowed by the policy due to the urgent nature of the change.\n\nIn terms of third-party involvement, the policy applies to all employees, contractors, and third-party vendors involved in the implementation of changes to IT systems and services. While our audit did not specifically review third-party segregation of duties, the policy's broad scope suggests that third-party activities would also be subject to the same controls.\n\nIn conclusion, Fountain Plc has a robust change management control in place that ensures segregation of duties and includes provisions for emergency situations. The company's practices align with the key considerations for this audit. We recommend continued monitoring to ensure ongoing compliance with these controls.",
                "implementation_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Emergency_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Emergency Change Management Ticket\nChange Request ID: CHG003\nTransport Request: DEVK900003\nRequest Date: 2024-08-15\nApproval Date: 2024-08-15\nTest Date: 2024-08-15\nTest Approval: N/A (Emergency Change)\nRequester: DClark\nTester: DClark\nApprover: SClark\nImplementer: DClark\nDeveloper: USER003\nApproval Status: Approved\nChange Summary\nTitle: Critical Patch Deployment for Security Vulnerability\nType: Emergency Change\nPriority: High\nDescription: This emergency change request involves deploying a critical security patch to address\na newly discovered vulnerability in the customer-facing web application. The patch must be applied\nimmediately to prevent potential exploitation by malicious actors.\nReason for Change\nA critical security vulnerability was identified that could allow unauthorized access to customer data.\nImmediate action is required to deploy the security patch and protect sensitive information.\nImpact AnalysisAffected Modules: Web Application (Customer Portal)\nImpact on Users: Minimal. Users may experience a brief downtime during the patch deployment.\nDowntime Required: Yes, estimated downtime of 15 minutes.\nRisk Assessment: High. While the risk of not deploying the patch is severe, the deployment itself\ncarries minimal risk if done promptly.\nImplementation Plan\n1. Preparation: Notify the IT security team and affected departments of the upcoming patch\ndeployment.\n2. Deployment: Apply the security patch to the production environment immediately.\n3. Verification: Perform quick post-deployment checks to ensure the patch was applied successfully\nand the system is stable.\n4. Documentation: Update system logs and security documentation with details of the patch\ndeployment.\nRollback Plan\nIn the unlikely event of a failure, the patch can be removed, and the system will revert to its\npre-patch state. This may extend the downtime by an additional 10 minutes.\nTesting Summary\nDue to the emergency nature of this change, testing was limited to a controlled environment with\nsimulated data. The patch was verified to fix the vulnerability without introducing new issues.\nApproval\nThe change was approved by SClark on 2024-08-15, with immediate implementation following the\nidentification of the critical vulnerability.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders immediately following the deployment.- Post-Implementation Review: A detailed review will be conducted within 48 hours to assess the\neffectiveness of the patch and any impacts on the system."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Change Management Ticket\nChange Request ID: CHG002\nTransport Request: DEVK900002\nRequest Date: 2024-08-15\nApproval Date: 2024-08-18\nTest Date: 2024-08-17\nTest Approval: Yes\nRequester: AJohnson\nTester: AJohnson\nApprover: SClark\nImplementer: AJohnson\nDeveloper: USER002\nApproval Status: Approved\nChange Summary\nTitle: Deployment of Customer Data Integration Module\nType: Normal Change\nPriority: High\nDescription: This change request involves deploying a new customer data integration module to\nenhance the CRM system. The module provides real-time synchronization of customer data across\nall platforms, improving customer service efficiency and accuracy.\nReason for Change\nThe current CRM system lacks real-time data synchronization, leading to inconsistencies and\ndelayed updates. The new module addresses these issues by ensuring that customer data is always\nup-to-date across all platforms.Impact Analysis\nAffected Modules: CRM System\nImpact on Users: Minimal. The new module will run in the background and will not disrupt current\noperations.\nDowntime Required: No\nRisk Assessment: Medium. The module has undergone extensive testing in a staging environment.\nImplementation Plan\n1. Preparation: Verify all dependencies and ensure backups are taken.\n2. Deployment: Transport request DEVK900002 will be moved to the production environment.\n3. Verification: Perform post-deployment testing to confirm all functions are operational.\n4. Documentation: Update system documentation and user guides.\nRollback Plan\nIn case of issues, the transport request will be reversed to restore the system to its previous state\nwithout data loss.\nTesting Summary\nThe module was thoroughly tested by AJohnson on 2024-08-17. All functionalities, including data\naccuracy, performance, and integration, were verified to work as intended.\nApproval\nThe change was approved by SClark on 2024-08-18 following successful testing and impact\nanalysis.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders before deployment.\n- Training: Provide training sessions for users on the new module's features."
                    }
                ],
                "answer": "Pass"
            },
            {
                "Domain": "Segregation of duties",
                "tailored_procedure_design": "The approval for promotion in accordance with agreed upon policies and/or procedures.",
                "design_details": "The approval for promotion of changes to the production environment at Fountain Plc is governed by their Change Management Policy, which was approved in December 2021. The policy outlines the required approval levels for each type of change. The Change Advisory Board (CAB), consisting of senior IT members, initiates the approval process. Both the process owner and the CAB must sign off before a change is promoted to production. \n\nThis process is enforced through the ServiceNow platform, where all changes, approvals, and implementation plans are documented. The platform also allows for tracking of approvals, ensuring that the appropriate individuals have given their consent for the changes. \n\nIn the case of emergency changes, verbal approval from the CAB or CIO is required before deployment. However, formal approval and documentation must be completed within 48 hours of the deployment. \n\nThe CAB is responsible for enforcing these controls and they are considered well-qualified and appropriate for this role. These controls have been in place since December 2021, when the Change Management Policy was approved. \n\nDuring the audit walkthrough conducted by Emma from PwC and John, the IT Manager at Fountain Plc, it was confirmed that these procedures are followed consistently for all changes, regardless of the type or the application (hosted, SaaS, or internally developed). \n\nThe audit team from PwC, therefore, concludes that the design and implementation of the Change Management controls at Fountain Plc are in accordance with the agreed-upon policies and procedures.",
                "design_details_from_example": "Based on our audit of Fountain Plc for the year ending 2024-12-31, we have reviewed the design and implementation of their change management control. Specifically, we have examined the approval process for promoting changes in accordance with their established policies and procedures.\n\nFountain Plc has a well-defined Change Management Policy that outlines the approval process for promoting changes. The Change Advisory Board (CAB), which consists of senior IT members, is responsible for initiating the approval process. The process owner and the CAB must both sign off before a change is promoted to production. This ensures that the change has been thoroughly reviewed and approved by the appropriate authorities before it is implemented.\n\nIn addition to the approval process, Fountain Plc also has a robust testing procedure in place. All changes, regardless of their type, must be tested in a controlled environment before they are deployed. The results of these tests are meticulously documented in their ServiceNow platform. Any issues that arise during testing are logged and addressed before final approval is given. This ensures that only changes that have been thoroughly tested and deemed to be safe and effective are promoted to production.\n\nFurthermore, Fountain Plc has implemented a segregation of duties to ensure that the developer of a change is different from the implementer of the change. This is mandated by their Change Management Policy, which states that changes must be promoted by someone other than the developer who made the change. This segregation of duties helps to prevent any potential conflicts of interest and ensures that the change is reviewed and implemented objectively.\n\nIn conclusion, based on our audit, Fountain Plc has a well-designed and effectively implemented change management control. Their approval process for promoting changes aligns with their established policies and procedures, and they have robust testing procedures and a clear segregation of duties in place. These controls have been in place since December 2021 and are enforced by the CAB, which has the appropriate authority to do so.",
                "design_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Walkthrough_Transcript.pdf",
                        "text": "Fountain Plc - Change Management Walkthrough Transcript\nParticipants:\n- Emma (PwC Auditor)\n- John (Fountain Plc IT Manager)\nDate: May 2024\nTranscript\nEmma (PwC Auditor): Can you explain the procedures you have in place for testing, reviewing, and\nauthorizing changes, including emergency changes?\nJohn (Fountain Plc IT Manager): At Fountain Plc, we follow our Change Management Policy and\nStandard Operating Procedures, which were approved by our CIO in December 2021. These\nprocedures outline the entire process for initiating, testing, and approving changes to our IT\nsystems.\nEmma: Who is responsible for making changes to application code or configurations, and how are\nthese changes managed?\nJohn: Changes to application code are handled by our in-house development team. Configuration\nchanges are typically managed by our system administrators. Both types of changes must go\nthrough our standard change management process, which includes logging the change in\nServiceNow, conducting tests, and obtaining approvals from the Change Advisory Board (CAB).\nEmma: How do you define the criteria for emergency changes, and what are the requirements fortesting and approvals in these cases?\nJohn: An emergency change is defined as a change required to prevent or mitigate a critical issue\nthat could disrupt core business operations. For these changes, verbal approval from the CAB or\nCIO is required before deployment. Although the change is implemented immediately, we conduct\ntesting and document the change as soon as possible afterward. Formal approval and\ndocumentation must be completed within 48 hours of the deployment.\nEmma: How do you determine if a change qualifies as an emergency change?\nJohn: The CAB retrospectively reviews the situation to determine whether the emergency criteria\nwere met. Whenever possible, we seek written approval after the deployment.\nEmma: How do you ensure that all changes follow a consistent process, regardless of the type?\nJohn: All changes, whether standard or emergency, are logged and managed through our\nServiceNow platform. We apply the same process across all in-scope applications to ensure\nconsistency in our change management procedures.\nEmma: How do you handle changes to different types of applications, such as hosted applications,\nSaaS solutions, or internally developed systems?\nJohn: Regardless of the application type, whether hosted, SaaS, or internally developed, all\nchanges are categorized as either standard or emergency. They all follow the same change\nmanagement process as outlined in our policy.\nEmma: How do you assess and manage the risks associated with different types of changes?John: Risk assessments are an integral part of our change request process. All changes are logged\nin ServiceNow and are categorized based on their potential impact. The risk level influences the\ndepth of testing required and the level of approval needed.\nEmma: How do you create and validate test cases, scripts, and plans to ensure proper testing?\nJohn: Test cases and scripts are developed by the development team in collaboration with business\nusers. These test cases are executed in a controlled test environment, and the results are\nmeticulously documented. Any issues identified are resolved before the change is promoted to the\nproduction environment.\nEmma: How do you confirm that the appropriate individuals are approving the changes?\nJohn: The required approval levels for each type of change are clearly outlined in our Change\nManagement Policy. Approvals are logged in ServiceNow, and the CAB reviews and signs off on the\nchanges before they are implemented.\nEmma: How do you ensure that all relevant stakeholders have approved the testing cases, scripts,\nand plans?\nJohn: Approvals are tracked and logged within the change tickets in ServiceNow. Each stakeholder\nrecords their approval as part of the workflow, and these are reviewed by the CAB before the\nchange is finalized.\nEmma: How do you document and approve the results of testing procedures?John: The results of all testing procedures are documented in ServiceNow. Any issues that arise\nduring testing are logged and addressed before final approval is given.\nEmma: How do you ensure that the version promoted to production is the one that was approved?\nJohn: We utilize version control software to track changes. The version that is to be promoted is\ncompared against the approved version as part of the change management process.\nEmma: How do you maintain segregated access to development, testing, and production\nenvironments?\nJohn: We ensure segregation by assigning different roles for development, testing, and deployment.\nDevelopers do not have access to the production environment. Our Change Management Policy\nmandates that changes must be promoted by someone other than the developer who made the\nchange.\nEmma: How do you handle the approval for promoting changes to production?\nJohn: The required approval levels are defined in our Change Management Policy. The CAB\ninitiates the approval process, and both the process owner and the CAB must sign off before a\nchange is promoted to production.\nEmma: How long have these controls been in place?\nJohn: These controls have been in place since December 2021, when the Change Management\nPolicy was approved.Emma: Who is responsible for enforcing these controls, and do they have the appropriate authority?\nJohn: The CAB, which consists of senior IT members, is responsible for enforcing the change\nmanagement controls. They are considered well-qualified and appropriate for this role."
                    }
                ],
                "tailored_procedure_implementation": "For one change inspect the approval for promotion in accordance with agreed upon policies and/or procedures.",
                "implementation_details": "For the purpose of this audit, we inspected the approval for promotion in accordance with agreed upon policies and procedures for the change request ID: CHG002, titled \"Deployment of Customer Data Integration Module\". \n\nAccording to the Change Management Policy of Fountain Plc, all changes must be approved by the Change Advisory Board (CAB) or designated approvers. The policy also states that changes must be promoted by someone other than the developer. In emergencies, temporary access may be granted. All promotions must adhere to established policies and procedures.\n\nIn the case of change request CHG002, the approval was granted by SClark, who is presumably a member of the CAB or a designated approver, as per the policy. The approval date was 2024-08-18, three days after the request date, indicating that the change went through the necessary assessment and approval process. \n\nThe policy also requires that all change requests, approvals, implementation plans, and test results must be documented in ServiceNow. The documentation for CHG002 confirms that the change was approved following successful testing and impact analysis. \n\nTherefore, based on the information provided, it appears that the approval for promotion for change request CHG002 was in accordance with Fountain Plc's Change Management Policy.",
                "implementation_details_from_example": "For the audit period ending on 2024-12-31, we selected the change under ticket CHG003 for detailed inspection. This change was classified as an Emergency Change and was titled \"Critical Patch Deployment for Security Vulnerability\". \n\nThe change was developed by USER003, as per the information provided in the ticket. The change was requested by DClark, who also served as the tester and implementer for this change. This is an exception to the standard segregation of duties as outlined in the Fountain Plc's Change Management Policy, which states that changes must be promoted by someone other than the developer. However, the policy also allows for temporary access in emergencies, which is the case for this change.\n\nThe change was approved by SClark on the same day it was requested, which is in line with the policy's provision for Emergency Changes that require immediate implementation due to critical issues. The approval status is clearly marked as \"Approved\" in the ticket.\n\nIn terms of testing, the ticket notes that due to the emergency nature of the change, testing was limited to a controlled environment with simulated data. The patch was verified to fix the vulnerability without introducing new issues. This aligns with the policy's requirement for changes to be tested in a controlled environment prior to deployment.\n\nIn conclusion, while there was an exception to the standard segregation of duties, this was justified by the emergency nature of the change. The approval, testing, and implementation of the change were in accordance with Fountain Plc's Change Management Policy. Further audit procedures will be conducted to ensure the effectiveness of these controls and adherence to the policy.",
                "implementation_reference": [
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Policy.pdf",
                        "text": "Fountain Plc Change Management \nPolicy  \nPurpose:  \nThe purpose of this policy is to ensure that all changes to Fountain Plc’s IT systems and \nservices are managed efficiently, minimizing risks and maintaining the integrity and \navailability of IT services.  \nScope:  \nThis policy applies to all employees, contractors, and third -party vendors involved in the \nimplementation of changes to IT systems and services.  \nPolicy Overview:  \n1. Change Types:  \n• Standard Change: Pre -approved, low -risk changes with established procedures.  \n• Normal Change: Changes that require risk assessment and approval.  \n• Emergency Change: Changes that must be implemented immediately due to critical issues.  \n• Application Code Changes: Managed by developers. Changes must be version -controlled \nand follow standard change control processes.  \n• Configuration Changes: Managed by system administrators. Changes to settings or \ntolerances that do not require code amendments must follow the same change control \nprocesses.  \n2. Emergency Change Criteria:  \n• Defined as changes necessary to resolve critical issues that cannot wait for normal \nprocessing.  \n• Testing and Approval Timing: Must occur within 48 hours of promotion to production.  \n• Determination: Control operators trace back to an emergency change request.  \n3. Change Request Process:  \n• Initiation: All change requests must be submitted through the ServiceNow platform.  \n• Assessment: Each request will be assessed for impact, risk, and resource requirements.  \n• Approval: Changes must be approved by the Change Advisory Board (CAB) or designated \napprovers.  \n• Implementation: Approved changes will be scheduled and implemented by qualified \npersonnel.  • Testing: Changes must be tested in a controlled environment prior to deployment.  \n• Review: Post -implementation reviews will be conducted to assess the change outcome.  \n4. Roles and Responsibilities:  \n• Change Requester: Initiates and provides details for the change request.  \n• Change Manager: Reviews requests, coordinates assessments, and facilitates CAB \nmeetings.  \n• CAB: Evaluates and approves changes, ensuring alignment with business objectives.  \n• Implementer: Executes the change according to the approved plan.  \n• Tester: Conducts testing to ensure the change meets acceptance criteria.  \n5. Risk and Impact Assessment:  \n• Changes will be assessed for potential impact on systems, users, and business operations.  \n• Risk levels will be categorized as low, medium, or high, influencing the approval process.  \n6. Testing Requirements:  \n• Levels: Unit, integration, regression, and user acceptance testing based on scope and \ncomplexity.  \n• Test Case Creation: Control operators develop test cases, scripts, and plans to ensure \nthorough testing.  \n• Approval of Test Plans: Stakeholders, including IT and business representatives, must \napprove testing plans. Approvers are verified against a list of authorized individuals.  \n7. Documentation:  \n• All change requests, approvals, implementation plans, and test results must be \ndocumented in ServiceNow.  \n• Detailed records will be maintained for audit and compliance purposes.  \n• Changes are compared to approved versions using manual checks or version control \nsoftware to ensure accuracy in promotion.  \n8. Segregation of Duties:  \n• Management ensures access to development, test, and production environments is \nappropriately segregated.  \n• In emergencies, elevated accounts (e.g., firefighter) may be used with proper controls.  \n9. Communication:  \n• Stakeholders will be informed of upcoming changes, potential impacts, and post -\nimplementation results.  \n• Emergency changes require immediate communication to affected parties.  \n10. Emergency Change Process:  \n• Emergency changes must be documented and justified in ServiceNow.  \n• Post -implementation reviews are mandatory to evaluate the change’s effectiveness and \nimpact.  11. Training:  \n• Regular training sessions will be conducted to ensure all employees understand the \nchange management process and their responsibilities.  \n12. Promotion Process:  \n• Changes must be promoted by someone other than the developer. In emergencies, \ntemporary access may be granted.  \n• Approval for Promotion: All promotions must adhere to established policies and \nprocedures.  \nPolicy Compliance:  \nFailure to comply with this policy may result in disciplinary action, up to and including \ntermination of employment or contract.  \nReview and Updates:  \nThis policy will be reviewed annually and updated as necessary to ensure continued \nrelevance and compliance with industry standards.  \nApproval:  \nThis Change Management Policy has been reviewed and approved by the executive \nmanagement of Fountain Plc.  \n \n• Approved by: Sean John, CIO  \n• Date of Approval: December 2021"
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Emergency_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Emergency Change Management Ticket\nChange Request ID: CHG003\nTransport Request: DEVK900003\nRequest Date: 2024-08-15\nApproval Date: 2024-08-15\nTest Date: 2024-08-15\nTest Approval: N/A (Emergency Change)\nRequester: DClark\nTester: DClark\nApprover: SClark\nImplementer: DClark\nDeveloper: USER003\nApproval Status: Approved\nChange Summary\nTitle: Critical Patch Deployment for Security Vulnerability\nType: Emergency Change\nPriority: High\nDescription: This emergency change request involves deploying a critical security patch to address\na newly discovered vulnerability in the customer-facing web application. The patch must be applied\nimmediately to prevent potential exploitation by malicious actors.\nReason for Change\nA critical security vulnerability was identified that could allow unauthorized access to customer data.\nImmediate action is required to deploy the security patch and protect sensitive information.\nImpact AnalysisAffected Modules: Web Application (Customer Portal)\nImpact on Users: Minimal. Users may experience a brief downtime during the patch deployment.\nDowntime Required: Yes, estimated downtime of 15 minutes.\nRisk Assessment: High. While the risk of not deploying the patch is severe, the deployment itself\ncarries minimal risk if done promptly.\nImplementation Plan\n1. Preparation: Notify the IT security team and affected departments of the upcoming patch\ndeployment.\n2. Deployment: Apply the security patch to the production environment immediately.\n3. Verification: Perform quick post-deployment checks to ensure the patch was applied successfully\nand the system is stable.\n4. Documentation: Update system logs and security documentation with details of the patch\ndeployment.\nRollback Plan\nIn the unlikely event of a failure, the patch can be removed, and the system will revert to its\npre-patch state. This may extend the downtime by an additional 10 minutes.\nTesting Summary\nDue to the emergency nature of this change, testing was limited to a controlled environment with\nsimulated data. The patch was verified to fix the vulnerability without introducing new issues.\nApproval\nThe change was approved by SClark on 2024-08-15, with immediate implementation following the\nidentification of the critical vulnerability.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders immediately following the deployment.- Post-Implementation Review: A detailed review will be conducted within 48 hours to assess the\neffectiveness of the patch and any impacts on the system."
                    },
                    {
                        "source": "chunk_0",
                        "file_name": "Fountain_Plc_Change_Management_Ticket.pdf",
                        "text": "Fountain Plc - Change Management Ticket\nChange Request ID: CHG002\nTransport Request: DEVK900002\nRequest Date: 2024-08-15\nApproval Date: 2024-08-18\nTest Date: 2024-08-17\nTest Approval: Yes\nRequester: AJohnson\nTester: AJohnson\nApprover: SClark\nImplementer: AJohnson\nDeveloper: USER002\nApproval Status: Approved\nChange Summary\nTitle: Deployment of Customer Data Integration Module\nType: Normal Change\nPriority: High\nDescription: This change request involves deploying a new customer data integration module to\nenhance the CRM system. The module provides real-time synchronization of customer data across\nall platforms, improving customer service efficiency and accuracy.\nReason for Change\nThe current CRM system lacks real-time data synchronization, leading to inconsistencies and\ndelayed updates. The new module addresses these issues by ensuring that customer data is always\nup-to-date across all platforms.Impact Analysis\nAffected Modules: CRM System\nImpact on Users: Minimal. The new module will run in the background and will not disrupt current\noperations.\nDowntime Required: No\nRisk Assessment: Medium. The module has undergone extensive testing in a staging environment.\nImplementation Plan\n1. Preparation: Verify all dependencies and ensure backups are taken.\n2. Deployment: Transport request DEVK900002 will be moved to the production environment.\n3. Verification: Perform post-deployment testing to confirm all functions are operational.\n4. Documentation: Update system documentation and user guides.\nRollback Plan\nIn case of issues, the transport request will be reversed to restore the system to its previous state\nwithout data loss.\nTesting Summary\nThe module was thoroughly tested by AJohnson on 2024-08-17. All functionalities, including data\naccuracy, performance, and integration, were verified to work as intended.\nApproval\nThe change was approved by SClark on 2024-08-18 following successful testing and impact\nanalysis.\nAdditional Notes\n- Communication Plan: Notify all relevant stakeholders before deployment.\n- Training: Provide training sessions for users on the new module's features."
                    }
                ],
                "answer": "Pass"
            }
        ]
    },
    "findings": {
        "overview": "",
        "summary": ""
    }
}